{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hello, thanks for visiting",
        "Good to see you again",
        "Hi there, how can I help?"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ],
      "context_set": ""
    },
    {
      "tag": "introduce",
      "patterns": [
        "What is your name",
        "What do I call you",
        "Who are you",
        "Introduce yourself"
      ],
      "responses": [
        "I'm Apler, in short of APlus-er. Yes, I'm happy to be a member of A Plus. We are like viking warriors. We fight for code quality till the end of the world.",
        "I'm a friendly bot coming from A Plus. You can call me Apler which means APlus-er. What's more, we possess a strong spirit of viking warriors. We fight for code quality till the end of the world."
      ]
    },
    {
      "tag": "aplus_general",
      "patterns": [
        "What is A Plus",
        "What is APlus",
        "What is A+",
        "Do you know A Plus",
        "Do you know APlus",
        "Do you know A+"
      ],
      "responses": [
        "A Plus is a BU in KMS where you can find very nice people there"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ],
      "context_set": ""
    },
    {
      "tag": "hours",
      "patterns": [
        "What hours are you open?",
        "What are your hours?",
        "When are you open?"
      ],
      "responses": [
        "We're open every day 9am-9pm",
        "Our hours are 9am-9pm every day"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and AMEX",
        "We accept most major credit cards"
      ]
    },
    {
      "tag": "opentoday",
      "patterns": [
        "Are you open today?",
        "When do you open today?",
        "What are your hours today?"
      ],
      "responses": [
        "We're open every day from 9am-9pm",
        "Our hours are 9am-9pm every day"
      ]
    },
    {
      "tag": "BU_Account",
      "patterns": [
        "How many working accounts in BU A++?",
        "Are there 11 working projects in BU A+?",
        "There are 11 working accounts in BU A+, aren't there?",
        "BU A+ has 11 working projects, hasn't it?",
        "The total accounts in BU A++ is 11, isn't it?",
        "Is the total working accounts in BU A++ 11?",
        "Are there eleven working accounts in BU A+?",
        "There are eleven working projects in BU A+, aren't there?",
        "BU A+ has eleven working accounts, hasn't it?",
        "The total woring accounts in BU A++ is eleven, isn't it?",
        "Is the total working accounts in BU A++ eleven?"
      ],
      "responses": [
        "Yes, there are 11 working projects/accounts in BU A+"
      ]
    },
    {
      "tag": "BU_Manager",
      "patterns": [
        "How many managers in BU A++?",
        "Are there 5 managers in BU A+?",
        "There are 5 managers in BU A+, aren't there?",
        "BU A+ has 5 managers, hasn't it?",
        "The total test projects in BU A++ is 5, isn't it?",
        "Is the total managers in BU A++ 5?",
        "Are there five engineering managers in BU A+?",
        "There are five managers in BU A+, aren't there?",
        "BU A+ has five engineering managers, hasn't it?",
        "The total managers in BU A++ is five, isn't it?",
        "Is the total managers in BU A++ five?"
      ],
      "responses": [
        "Yes, there are 5 Engineering Managers"
      ]
    },
    {
      "tag": "BU_Head",
      "patterns": [
        "Who is BU A+ head?",
        "Who's BU A+ head?",
        "BU A+ leader is MaiLe, isn't it?",
        "BU A+ head's MaiLe, isn't it?",
        "MaiLe is a BU A+ head, isn't she?",
        "Is MaiLe a BU A+ head?",
        "What is the name of BU A+ head?",
        "What's the name of BU A+ head?",
        "MaiLe is a head of BU A+ isn't she?",
        "Is MaiLe a head of BU A+?",
        "What is the name of BU A+ head?",
        "What is the head name of BU A+?",
        "What's the name of BU A+ head?",
        "What's the head name of BU A+?",
        "Who is BU A+ head?",
        "Who's BU A+ head?",
        "Who is the leader of BU A+?",
        "Who's the head of BU A+?",
        "BU A+ head is MaiLe, isn't it?",
        "head of BU A+ is MaiLe, isn't it?",
        "BU A+ head's MaiLe, isn't it?",
        "Head of BU A+ 's MaiLe, isn't it?",
        "MaiLe is a BU A+ head, isn't she?",
        "MaiLe is a leader of BU A+, isn't she?",
        "Is MaiLe a BU A+ head?",
        "Is MaiLe a leader of BU A+?",
        "What is the name of BU A+ head?",
        "What is the head name of BU A+?",
        "What's the name of BU A+ leader?",
        "What's the head name of BU A+?"
      ],
      "responses": [
        "Yes, MaiLe is the VP of the BU A+, She is a nice woman..."
      ],
      "context_set": "maile"
    },
    {
      "tag": "MaiLeAge",
      "patterns": [
        "How old is she?",
        "How old is Mai Le?",
        "How old?"
      ],
      "responses": [
        "Sorry, I don't think asking woman's age is nice"
      ],
      "context_filter": "maile"
    },
    {
      "tag": "MaiLeKms",
      "patterns": [
        "How long does she work for KMS?",
        "How long does Mai Le work for KMS?",
        "When does she join KMS?"
      ],
      "responses": [
        "She joined KMS from Sep 2010 until now"
      ],
      "context_filter": "maile"
    },
    {
      "tag": "MaiLeMarriage",
      "patterns": [
        "Is she married?",
        "Is Mai Le married?"
      ],
      "responses": [
        "Yes, she is",
        "She has a husband and a kid"
      ],
      "context_filter": "maile"
    },
    {
      "tag": "medidata",
      "patterns": [
        "What is the medidata?",
        "What is the medidata project?",
        "What is the medidata test project?",
        "What is this medidata?",
        "What is this medidata project?",
        "What is this medidata test project?",
        "What is the medidata in BU A+?",
        "What is the medidata project in BU A+?",
        "What is the medidata test project?",
        "What is this medidata in BU A+?",
        "What is this medidata project in BU A+?",
        "What is this medidata test project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a test project in BU A+",
        "Yes, this is one of test projects in BU A+"
      ],
      "context_set": "medidata"
    },
    {
      "tag": "medidata_office",
      "patterns": [
        "What is the medidata customer address?",
        "What is the addresss of owner medidata customer?",
        "What is the addresss of medidata owner?"
      ],
      "responses": [
        "Yes, the medidata customer is a USA customer. His address is: 350 Hudson Street, New York, NY 10014, USA"
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidata_domain",
      "patterns": [
        "Which industry does medidata work in?",
        "Which field is medidata about?",
        "Which industry does medidata work in?",
        "Which field is medidata about?",
        "Medidata's business domain?",
        "What's the medidata's Business/Domain?",
        "What's the medidata project 's Business/Domain?",
        "What's the medidata test project 's Business/Domain?",
        "What's this medidata's Business/Domain?",
        "What's this medidata project 's Business/Domain?",
        "What's this medidata test project 's Business/Domain?",
        "What is the medidata's Business/Domain?",
        "What is the medidata project 's Business or Domain?",
        "What is the medidata test project 's Business or Domain?",
        "What is this medidata's Business or Domain?",
        "What is this medidata project 's Business or Domain?",
        "What is this medidata test project 's Business or Domain?",
        "What's the medidata Business or Domain?",
        "What's the medidata project Business or Domain?",
        "What's the medidata test project Business or Domain?",
        "What is this medidata Business or Domain?",
        "What is this medidata project Business or Domain?",
        "What is this medidata test project Business or Domain?",
        "What is the Business or Domain of the medidata?",
        "What is the Business or Domain of the medidata project?",
        "What is the Business or Domain of the medidata test project?",
        "What is the Business or Domain of this medidata?",
        "What is the Business or Domain of this medidata project?",
        "What is the Business or Domain of this medidata test project?",
        "The Business or Domain of the medidata belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the medidata project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the medidata test project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this medidata belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this medidata project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this medidata test project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the medidata belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the medidata project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the medidata test project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this medidata belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this medidata project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this medidata test project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the medidata belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the medidata project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the medidata test project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this medidata belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this medidata project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this medidata test project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the medidata is in the Healthcare area, isn't it?",
        "The Business or Domain of the medidata project is in the Healthcare area, isn't it?",
        "The Business or Domain of the medidata test project is in the Healthcare area, isn't it?",
        "The Business or Domain of this medidata is in the Healthcare area, isn't it?",
        "The Business or Domain of this medidata project is in the Healthcare area, isn't it?",
        "The Business or Domain of this medidata test project is in the Healthcare area, isn't it?",
        "The Business or Domain of the medidata is in the Healthcare field, isn't it?",
        "The Business or Domain of the medidata project is in the Healthcare field, isn't it?",
        "The Business or Domain of the medidata test project is in the Healthcare field, isn't it?",
        "The Business or Domain of this medidata is in the Healthcare field, isn't it?",
        "The Business or Domain of this medidata project is in the Healthcare field, isn't it?",
        "The Business or Domain of this medidata test project is in the Healthcare field, isn't it?",
        "The Business or Domain of the medidata is in the Healthcare industry, isn't it?",
        "The Business or Domain of the medidata project is in the Healthcare industry, isn't it?",
        "The Business or Domain of the medidata test project is in the Healthcare industry, isn't it?",
        "The Business or Domain of this medidata is in the Healthcare industry, isn't it?",
        "The Business or Domain of this medidata project is in the Healthcare industry, isn't it?",
        "The Business or Domain of this medidata test project is in the Healthcare industry, isn't it?",
        "Is the Business or Domain of the medidata in the Healthcare area?",
        "Is the Business or Domain of the medidata project in the Healthcare area?",
        "Is the Business or Domain of the medidata test project in the Healthcare area?",
        "Is the Business or Domain of this medidata in the Healthcare area?",
        "Is the Business or Domain of this medidata project in the Healthcare area?",
        "Is the Business or Domain of this medidata test project in the Healthcare area?",
        "Is the Business or Domain of the medidata in the Healthcare field?",
        "Is the Business or Domain of the medidata project in the Healthcare field?",
        "Is the Business or Domain of the medidata test project in the Healthcare field?",
        "Is the Business or Domain of this medidata in the Healthcare field?",
        "Is the Business or Domain of this medidata project in the Healthcare field?",
        "Is the Business or Domain of this medidata test project in the Healthcare field?",
        "Is the Business or Domain of the medidata in the Healthcare industry?",
        "Is the Business or Domain of the medidata project in the Healthcare industry?",
        "Is the Business or Domain of the medidata test project in the Healthcare industry?",
        "Is the Business or Domain of this medidata in the Healthcare industry?",
        "Is the Business or Domain of this medidata project in the Healthcare industry?",
        "Is the Business or Domain of this medidata test project in the Healthcare industry?",
        "Does the Business or Domain of the medidata belong to the Healthcare area?",
        "Does the Business or Domain of the medidata project belong to the Healthcare area?",
        "Does the Business or Domain of the medidata test project belong to the Healthcare area?",
        "Does the Business or Domain of this medidata belong to the Healthcare?",
        "Does the Business or Domain of this medidata project belong to the Healthcare?",
        "Does the Business or Domain of this medidata test project belong to the Healthcare?",
        "Does the Business or Domain of the medidata belong to the Healthcare area?",
        "Does the Business or Domain of the medidata project belong to the Healthcare area?",
        "Does the Business or Domain of the medidata test project belong to the Healthcare area?",
        "Does the Business or Domain of this medidata belong to the Healthcare area?",
        "Does the Business or Domain of this medidata project belong to the Healthcare area?",
        "Does the Business or Domain of this medidata test project belong to the Healthcare area?",
        "Does the Business or Domain of the medidata belong to the Healthcare field?",
        "Does the Business or Domain of the medidata project belong to the Healthcare field?",
        "Does the Business or Domain of the medidata test project belong to the Healthcare field?",
        "Does the Business or Domain of this medidata belong to the Healthcare field?",
        "Does the Business or Domain of this medidata project belong to the Healthcare field?",
        "Does the Business or Domain of this medidata test project belong to the Healthcare field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the medidata test project belong to Healthcare field.",
        "Its domain is about Healthcare",
        "It provides products and services in Healthcare Industry.",
        "The company is classified in the Healthcare industry?"
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidata_site",
      "patterns": [
        "I want to know more information about medidata?",
        "Show me medidata's page?",
        "medidata's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://www.medidata.com/en/.",
        "Follow this link: https://www.medidata.com/en/."
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidata_start_date",
      "patterns": [
        "When was the contract between medidata and KMS signed?",
        "How long has medidata been our customer?",
        "What was the first date of medidata?",
        "Is the started date of the medidata in Aug 5, 2019?",
        "Was the medidata started in Aug 5, 2019?",
        "The medidata was started in Aug 5, 2019, wasn't it?",
        "In Aug 5, 2019, was the medidata started?",
        "Is the started date of the medidata project in Aug 5, 2019?",
        "Was the medidata project started in Aug 5, 2019?",
        "The medidata project was started in Aug 5, 2019, wasn't it?",
        "In Aug 5, 2019, was the medidata project started?",
        "Is the started date of the medidata test project in Aug 5, 2019?",
        "Was the medidata test project started in Aug 5, 2019?",
        "The medidata test project was started in Aug 5, 2019, wasn't it?",
        "In Aug 5, 2019, was the medidata test project started?",
        "when did the medidata start?",
        "when did the medidata begin?",
        "when did the medidata commence?",
        "when did the medidata initiate?",
        "when did the medidata project start?",
        "when did the medidata project begin?",
        "when did the medidata project commence?",
        "when did the medidata project initiate?",
        "when did the medidata test project start?",
        "when did the medidata test project begin?",
        "when did the medidata test project commence?",
        "when did the medidata test project initiate?",
        "when did this medidata start?",
        "when did this medidata begin?",
        "when did this medidata commence?",
        "when did this medidata initiate?",
        "when did this medidata project start?",
        "when did this medidata project begin?",
        "when did this medidata project commence?",
        "when did this medidata project initiate?",
        "when did this medidata test project start?",
        "when did this medidata test project begin?",
        "when did this medidata test project commence?",
        "when did this medidata test project initiate?",
        "what was the date the medidata started?",
        "what was the date the medidata begun?",
        "what was the date the medidata commenced?",
        "what was the date the medidata intiated?",
        "what was the date the medidata project started?",
        "what was the date the medidata project begun?",
        "what was the date the medidata project commenced?",
        "what was the date the medidata project intiated?",
        "what was the date the medidata test project started?",
        "what was the date the medidata test project begun?",
        "what was the date the medidata test project commenced?",
        "what was the date the medidata test project intiated?",
        "what was the date this medidata project started?",
        "what was the date this medidata project begun?",
        "what was the date this medidata project commenced?",
        "what was the date this medidata project intiated?",
        "what was the date this medidata test project started?",
        "what was the date this medidata test project begun?",
        "what was the date this medidata test project commenced?",
        "what was the date this medidata test project intiated?"
      ],
      "responses": [
        "Yes, The started date of medidata test project is Aug 5, 2019.",
        "It was on Aug 5, 2019",
        "Since Aug 5 2019"
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidata_member",
      "patterns": [
        "Does medidata have many people work for it?",
        "Tell me the size of medidata team",
        "Are there 2 members in the medidata?",
        "Are there 2 members in the medidata project?",
        "Are there 2 members in the medidata test project?",
        "Are there 2 members in this medidata?",
        "Are there 2 members in this medidata project?",
        "Are there 2 members in this medidata test project?",
        "Are there 2 QA members in the medidata?",
        "Are there 2 QA members in the medidata project?",
        "Are there 2 QA members in the medidata test project?",
        "Are there 2 QA members in this medidata?",
        "Are there 2 QA members in this medidata project?",
        "Are there 2 QA members in this medidata test project?",
        "There are 2 QA members in the medidata, are not there?",
        "There are 2 QA members in the medidata project, are not there?",
        "There are 2 QA members in the medidata test project, are not there?",
        "There are 2 QA members in this medidata, are not there?",
        "There are 2 QA members in this medidata project, are not there?",
        "There are 2 QA members in this medidata test project, are not there?",
        "There are 2 QA members in the medidata, aren't there?",
        "There are 2 QA members in the medidata project, aren't there?",
        "There are 2 QA members in the medidata test project, aren't there?",
        "There are 2 QA members in this medidata, are not there?",
        "There are 2 QA members in this medidata project, are not there?",
        "There are 2 QA members in this medidata test project, are not there?",
        "How many people in the medidata?",
        "How many people in the medidata project?",
        "How many people in the medidata test project?",
        "How many people in this medidata?",
        "How many people in this medidata project?",
        "How many people in this medidata test project?",
        "How many members in the medidata?",
        "How many members in the medidata project?",
        "How many members in the medidata test project?",
        "How many members in this medidata?",
        "How many members in this medidata project?",
        "How many members in this medidata test project?",
        "How many persons in the medidata?",
        "How many persons in the medidata project?",
        "How many persons in the medidata test project?",
        "How many persons in this medidata?",
        "How many persons in this medidata project?",
        "How many persons in this medidata test project?",
        "How about team size of the medidata?",
        "How about team size of the medidata project?",
        "How about team size of the medidata test project?",
        "How about team size of this medidata?",
        "How about team size of this medidata project?",
        "How about team size of this medidata test project?",
        "How about team size in the medidata?",
        "How about team size in the medidata project?",
        "How about team size in the medidata test project?",
        "How about team size in this medidata?",
        "How about team size in this medidata project?",
        "How about team size in this medidata test project?",
        "How many QA people in the medidata?",
        "How many QA people in the medidata project?",
        "How many QA people in the medidata test project?",
        "How many QA people in this medidata?",
        "How many QA people in this medidata project?",
        "How many QA people in this medidata test project?",
        "How many QA members in the medidata?",
        "How many QA members in the medidata project?",
        "How many QA members in the medidata test project?",
        "How many QA members in this medidata?",
        "How many QA members in this medidata project?",
        "How many QA members in this medidata test project?",
        "How many QA persons in the medidata?",
        "How many QA persons in the medidata project?",
        "How many QA persons in the medidata test project?",
        "How many QA persons in this medidata?",
        "How many QA persons in this medidata project?",
        "How many QA persons in this medidata test project?",
        "How about QA team size of the medidata?",
        "How about QA team size of the medidata project?",
        "How about QA team size of the medidata test project?",
        "How about QA team size of this medidata?",
        "How about QA team size of this medidata project?",
        "How about QA team size of this medidata test project?",
        "How about QA team size in the medidata?",
        "How about QA team size in the medidata project?",
        "How about QA team size in the medidata test project?",
        "How about QA team size in this medidata?",
        "How about QA team size in this medidata project?",
        "How about QA team size in this medidata test project?"
      ],
      "responses": [
        "Yes, there are 2 QA members in the medidata test project.",
        "It is a group of 2 members",
        "The team size is 2",
        "Medidata is currently working well with 2 people"
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidata_location",
      "patterns": [
        "How about the location of the medidata in TV office?",
        "How about the location of the medidata project  in TV office?",
        "How about the location of the medidata test project  in TV office?",
        "How about the location of this medidata in TV office?",
        "How about the location of this medidata project in TV office?",
        "How about the location of this medidata test project in TV office?",
        "What is the location of medidata?",
        "Where can I find medidata?",
        "How to meet medidata team?"
      ],
      "responses": [
        "You can find the medidata working space at 4th floor - TV office",
        "Do you intend to ask about the medidata's headquarters",
        "It's 350 Hudson Street, New York, NY 10014, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "medidataFavoriteActivities",
      "patterns": [
        "What do medidata team like to do?",
        "Which activities do medidata enjoy together?",
        "Favorite stuffs medidata do in free time?",
        "What do they do in their free time?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "The team'd love going out for drinking bubble tea & eating food.",
        "They enjoy spending time for drinking, singing as well as exploring new technology"
      ],
      "context_filter": "medidata"
    },
    {
      "tag": "kibo",
      "patterns": [
        "What is the kibo?",
        "What is the kibo project?",
        "What is the kibo test project?",
        "What is this kibo?",
        "What is this kibo project?",
        "What is this kibo test project?",
        "What is the kibo in BU A+?",
        "What is the kibo project in BU A+?",
        "What is the kibo test project?",
        "What is this kibo in BU A+?",
        "What is this kibo project in BU A+?",
        "What is this kibo test project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a test project in BU A+",
        "Yes, this is one of test projects in BU A+"
      ],
      "context_set": "kibo"
    },
    {
      "tag": "kibo_office",
      "patterns": [
        "What is the kibo customer address?",
        "What is the addresss of owner kibo customer?",
        "What is the addresss of kibo owner?"
      ],
      "responses": [
        "Yes, the kibo customer is a USA customer. His address is: 717 N Harwood St STE 1900, Dallas, TX 75201, USA"
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kibo_domain",
      "patterns": [
        "Which industry does kibo work in?",
        "Which field is kibo about?",
        "Which industry does kibo work in?",
        "Which field is kibo about?",
        "kibo's business domain?",
        "What's the kibo's Business/Domain?",
        "What's the kibo project 's Business/Domain?",
        "What's the kibo test project 's Business/Domain?",
        "What's this kibo's Business/Domain?",
        "What's this kibo project 's Business/Domain?",
        "What's this kibo test project 's Business/Domain?",
        "What is the kibo's Business/Domain?",
        "What is the kibo project 's Business or Domain?",
        "What is the kibo test project 's Business or Domain?",
        "What is this kibo's Business or Domain?",
        "What is this kibo project 's Business or Domain?",
        "What is this kibo test project 's Business or Domain?",
        "What's the kibo Business or Domain?",
        "What's the kibo project Business or Domain?",
        "What's the kibo test project Business or Domain?",
        "What is this kibo Business or Domain?",
        "What is this kibo project Business or Domain?",
        "What is this kibo test project Business or Domain?",
        "What is the Business or Domain of the kibo?",
        "What is the Business or Domain of the kibo project?",
        "What is the Business or Domain of the kibo test project?",
        "What is the Business or Domain of this kibo?",
        "What is the Business or Domain of this kibo project?",
        "What is the Business or Domain of this kibo test project?",
        "The Business or Domain of the kibo belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of the kibo project belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of the kibo test project belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of this kibo belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of this kibo project belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of this kibo test project belongs to the eCommerce platform, services area, doesn't it?",
        "The Business or Domain of the kibo belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of the kibo project belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of the kibo test project belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of this kibo belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of this kibo project belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of this kibo test project belongs to the eCommerce platform, services field, doesn't it?",
        "The Business or Domain of the kibo belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of the kibo project belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of the kibo test project belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of this kibo belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of this kibo project belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of this kibo test project belongs to the eCommerce platform, services industry, doesn't it?",
        "The Business or Domain of the kibo is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of the kibo project is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of the kibo test project is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of this kibo is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of this kibo project is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of this kibo test project is in the eCommerce platform, services area, isn't it?",
        "The Business or Domain of the kibo is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of the kibo project is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of the kibo test project is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of this kibo is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of this kibo project is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of this kibo test project is in the eCommerce platform, services field, isn't it?",
        "The Business or Domain of the kibo is in the eCommerce platform, services industry, isn't it?",
        "The Business or Domain of the kibo project is in the eCommerce platform, services industry, isn't it?",
        "The Business or Domain of the kibo test project is in the eCommerce platform, services industry, isn't it?",
        "The Business or Domain of this kibo is in the eCommerce platform, services industry, isn't it?",
        "The Business or Domain of this kibo project is in the eCommerce platform, services industry, isn't it?",
        "The Business or Domain of this kibo test project is in the eCommerce platform, services industry, isn't it?",
        "Is the Business or Domain of the kibo in the eCommerce platform, services area?",
        "Is the Business or Domain of the kibo project in the eCommerce platform, services area?",
        "Is the Business or Domain of the kibo test project in the eCommerce platform, services area?",
        "Is the Business or Domain of this kibo in the eCommerce platform, services area?",
        "Is the Business or Domain of this kibo project in the eCommerce platform, services area?",
        "Is the Business or Domain of this kibo test project in the eCommerce platform, services area?",
        "Is the Business or Domain of the kibo in the eCommerce platform, services field?",
        "Is the Business or Domain of the kibo project in the eCommerce platform, services field?",
        "Is the Business or Domain of the kibo test project in the eCommerce platform, services field?",
        "Is the Business or Domain of this kibo in the eCommerce platform, services field?",
        "Is the Business or Domain of this kibo project in the eCommerce platform, services field?",
        "Is the Business or Domain of this kibo test project in the eCommerce platform, services field?",
        "Is the Business or Domain of the kibo in the eCommerce platform, services industry?",
        "Is the Business or Domain of the kibo project in the eCommerce platform, services industry?",
        "Is the Business or Domain of the kibo test project in the eCommerce platform, services industry?",
        "Is the Business or Domain of this kibo in the eCommerce platform, services industry?",
        "Is the Business or Domain of this kibo project in the eCommerce platform, services industry?",
        "Is the Business or Domain of this kibo test project in the eCommerce platform, services industry?",
        "Does the Business or Domain of the kibo belong to the eCommerce platform, services area?",
        "Does the Business or Domain of the kibo project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of the kibo test project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of this kibo belong to the eCommerce platform, services?",
        "Does the Business or Domain of this kibo project belong to the eCommerce platform, services?",
        "Does the Business or Domain of this kibo test project belong to the eCommerce platform, services?",
        "Does the Business or Domain of the kibo belong to the eCommerce platform, services area?",
        "Does the Business or Domain of the kibo project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of the kibo test project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of this kibo belong to the eCommerce platform, services area?",
        "Does the Business or Domain of this kibo project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of this kibo test project belong to the eCommerce platform, services area?",
        "Does the Business or Domain of the kibo belong to the eCommerce platform, services field?",
        "Does the Business or Domain of the kibo project belong to the eCommerce platform, services field?",
        "Does the Business or Domain of the kibo test project belong to the eCommerce platform, services field?",
        "Does the Business or Domain of this kibo belong to the eCommerce platform, services field?",
        "Does the Business or Domain of this kibo project belong to the eCommerce platform, services field?",
        "Does the Business or Domain of this kibo test project belong to the eCommerce platform, services field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the kibo test project belong to eCommerce platform, services eCommerce platform, services and expertise designed specifically for mid to upper tier retailers.",
        "Its domain is about eCommerce platform, services and expertise designed specifically for mid to upper tier retailers.",
        "It provides eCommerce platform, services and expertise designed specifically for mid to upper tier retailers industry.",
        "The company is classified in the eCommerce platform, services industry?"
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kibo_site",
      "patterns": [
        "I want to know more information about kibo?",
        "Show me kibo's page?",
        "kibo's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://kibocommerce.com/.",
        "Follow this link: https://kibocommerce.com/."
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kibo_start_date",
      "patterns": [
        "When was the contract between kibo and KMS signed?",
        "How long has kibo been our customer?",
        "What was the first date of kibo?",
        "Is the started date of the kibo in Jan 1, 2010?",
        "Was the kibo started in Jan 1, 2010?",
        "The kibo was started in Jan 1, 2010, wasn't it?",
        "In Jan 1, 2010, was the kibo started?",
        "Is the started date of the kibo project in Jan 1, 2010?",
        "Was the kibo project started in Jan 1, 2010?",
        "The kibo project was started in Jan 1, 2010, wasn't it?",
        "In Jan 1, 2010, was the kibo project started?",
        "Is the started date of the kibo test project in Jan 1, 2010?",
        "Was the kibo test project started in Jan 1, 2010?",
        "The kibo test project was started in Jan 1, 2010, wasn't it?",
        "In Jan 1, 2010, was the kibo test project started?",
        "when did the kibo start?",
        "when did the kibo begin?",
        "when did the kibo commence?",
        "when did the kibo initiate?",
        "when did the kibo project start?",
        "when did the kibo project begin?",
        "when did the kibo project commence?",
        "when did the kibo project initiate?",
        "when did the kibo test project start?",
        "when did the kibo test project begin?",
        "when did the kibo test project commence?",
        "when did the kibo test project initiate?",
        "when did this kibo start?",
        "when did this kibo begin?",
        "when did this kibo commence?",
        "when did this kibo initiate?",
        "when did this kibo project start?",
        "when did this kibo project begin?",
        "when did this kibo project commence?",
        "when did this kibo project initiate?",
        "when did this kibo test project start?",
        "when did this kibo test project begin?",
        "when did this kibo test project commence?",
        "when did this kibo test project initiate?",
        "what was the date the kibo started?",
        "what was the date the kibo begun?",
        "what was the date the kibo commenced?",
        "what was the date the kibo intiated?",
        "what was the date the kibo project started?",
        "what was the date the kibo project begun?",
        "what was the date the kibo project commenced?",
        "what was the date the kibo project intiated?",
        "what was the date the kibo test project started?",
        "what was the date the kibo test project begun?",
        "what was the date the kibo test project commenced?",
        "what was the date the kibo test project intiated?",
        "what was the date this kibo project started?",
        "what was the date this kibo project begun?",
        "what was the date this kibo project commenced?",
        "what was the date this kibo project intiated?",
        "what was the date this kibo test project started?",
        "what was the date this kibo test project begun?",
        "what was the date this kibo test project commenced?",
        "what was the date this kibo test project intiated?"
      ],
      "responses": [
        "Yes, The started date of kibo test project is Jan 1, 2010.",
        "It was on Jan 1, 2010",
        "Since Jan 1, 2010"
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kibo_member",
      "patterns": [
        "Does kibo have many people work for it?",
        "Tell me the size of kibo team",
        "Are there 20 members in the kibo?",
        "Are there 20 members in the kibo project?",
        "Are there 20 members in the kibo test project?",
        "Are there 20 members in this kibo?",
        "Are there 20 members in this kibo project?",
        "Are there 20 members in this kibo test project?",
        "Are there 20 members in the kibo?",
        "Are there 20 members in the kibo project?",
        "Are there 20 members in the kibo test project?",
        "Are there 20 members in this kibo?",
        "Are there 20 members in this kibo project?",
        "Are there 20 members in this kibo test project?",
        "There are 20 members in the kibo, are not there?",
        "There are 20 members in the kibo project, are not there?",
        "There are 20 members in the kibo test project, are not there?",
        "There are 20 members in this kibo, are not there?",
        "There are 20 members in this kibo project, are not there?",
        "There are 20 members in this kibo test project, are not there?",
        "There are 20 members in the kibo, aren't there?",
        "There are 20 members in the kibo project, aren't there?",
        "There are 20 members in the kibo test project, aren't there?",
        "There are 20 members in this kibo, are not there?",
        "There are 20 members in this kibo project, are not there?",
        "There are 20 members in this kibo test project, are not there?",
        "How many people in the kibo?",
        "How many people in the kibo project?",
        "How many people in the kibo test project?",
        "How many people in this kibo?",
        "How many people in this kibo project?",
        "How many people in this kibo test project?",
        "How many members in the kibo?",
        "How many members in the kibo project?",
        "How many members in the kibo test project?",
        "How many members in this kibo?",
        "How many members in this kibo project?",
        "How many members in this kibo test project?",
        "How many persons in the kibo?",
        "How many persons in the kibo project?",
        "How many persons in the kibo test project?",
        "How many persons in this kibo?",
        "How many persons in this kibo project?",
        "How many persons in this kibo test project?",
        "How about team size of the kibo?",
        "How about team size of the kibo project?",
        "How about team size of the kibo test project?",
        "How about team size of this kibo?",
        "How about team size of this kibo project?",
        "How about team size of this kibo test project?",
        "How about team size in the kibo?",
        "How about team size in the kibo project?",
        "How about team size in the kibo test project?",
        "How about team size in this kibo?",
        "How about team size in this kibo project?",
        "How about team size in this kibo test project?",
        "How many people in the kibo?",
        "How many people in the kibo project?",
        "How many people in the kibo test project?",
        "How many people in this kibo?",
        "How many people in this kibo project?",
        "How many people in this kibo test project?",
        "How many members in the kibo?",
        "How many members in the kibo project?",
        "How many members in the kibo test project?",
        "How many members in this kibo?",
        "How many members in this kibo project?",
        "How many members in this kibo test project?",
        "How many persons in the kibo?",
        "How many persons in the kibo project?",
        "How many persons in the kibo test project?",
        "How many persons in this kibo?",
        "How many persons in this kibo project?",
        "How many persons in this kibo test project?",
        "How about team size of the kibo?",
        "How about team size of the kibo project?",
        "How about team size of the kibo test project?",
        "How about team size of this kibo?",
        "How about team size of this kibo project?",
        "How about team size of this kibo test project?",
        "How about team size in the kibo?",
        "How about team size in the kibo project?",
        "How about team size in the kibo test project?",
        "How about team size in this kibo?",
        "How about team size in this kibo project?",
        "How about team size in this kibo test project?"
      ],
      "responses": [
        "Yes, there are 20 members in the kibo test project.",
        "It is a group of 20 members",
        "The team size is 20",
        "kibo is currently working well with 20 people"
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kibo_location",
      "patterns": [
        "How about the location of the kibo in TV office?",
        "How about the location of the kibo project  in TV office?",
        "How about the location of the kibo test project  in TV office?",
        "How about the location of this kibo in TV office?",
        "How about the location of this kibo project in TV office?",
        "How about the location of this kibo test project in TV office?",
        "What is the location of kibo?",
        "Where can I find kibo?",
        "How to meet kibo team?"
      ],
      "responses": [
        "You can find the kibo working space at 5th floor - TV office",
        "Do you intend to ask about the kibo's headquarters",
        "It's 717 N Harwood St STE 1900, Dallas, TX 75201, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 5th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 5."
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "kiboFavoriteActivities",
      "patterns": [
        "What do kibo team like to do?",
        "Which activities do kibo enjoy together?",
        "Favorite stuffs kibo do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "Kibo needs food, loves food... So plz give us food.",
        "You want to hear a story, just come to Qui, an amazing-humorous-forever looped-story teller",
        "They enjoy spending time for drinking, singing as well as exploring new technology"
      ],
      "context_filter": "kibo"
    },
    {
      "tag": "dealer",
      "patterns": [
        "What is the dealer?",
        "What is the dealer project?",
        "What is the dealer development project?",
        "What is this dealer?",
        "What is this dealer project?",
        "What is this dealer development project?",
        "What is the dealer in BU A+?",
        "What is the dealer project in BU A+?",
        "What is the dealer development project?",
        "What is this dealer in BU A+?",
        "What is this dealer project in BU A+?",
        "What is this dealer development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "dealer"
    },
    {
      "tag": "dealer_office",
      "patterns": [
        "What is the dealer customer address?",
        "What is the addresss of owner dealer customer?",
        "What is the addresss of dealer owner?"
      ],
      "responses": [
        "Yes, the dealer customer is a US customer. His address is: 1 Howard St, Burlington, VT 05401, USA"
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealer_domain",
      "patterns": [
        "Which industry does dealer work in?",
        "Which field is dealer about?",
        "Which industry does dealer work in?",
        "Which field is dealer about?",
        "dealer's business domain?",
        "What's the dealer's Business or Domain?",
        "What's the dealer project 's Business or Domain?",
        "What's the dealer development project 's Business or Domain?",
        "What's this dealer's Business or Domain?",
        "What's this dealer project 's Business or Domain?",
        "What's this dealer development project 's Business or Domain?",
        "What is the dealer's Business or Domain?",
        "What is the dealer project 's Business or Domain?",
        "What is the dealer development project 's Business or Domain?",
        "What is this dealer's Business or Domain?",
        "What is this dealer project 's Business or Domain?",
        "What is this dealer development project 's Business or Domain?",
        "What's the dealer Business or Domain?",
        "What's the dealer project Business or Domain?",
        "What's the dealer development project Business or Domain?",
        "What is this dealer Business or Domain?",
        "What is this dealer project Business or Domain?",
        "What is this dealer development project Business or Domain?",
        "What is the Business or Domain of the dealer?",
        "What is the Business or Domain of the dealer project?",
        "What is the Business or Domain of the dealer development project?",
        "What is the Business or Domain of this dealer?",
        "What is the Business or Domain of this dealer project?",
        "What is the Business or Domain of this dealer development project?",
        "The Business or Domain of the dealer belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the dealer project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the dealer development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this dealer belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this dealer project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this dealer development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the dealer belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the dealer project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the dealer development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this dealer belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this dealer project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this dealer development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the dealer belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the dealer project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the dealer development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this dealer belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this dealer project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this dealer development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the dealer is in the Automobile area, isn't it?",
        "The Business or Domain of the dealer project is in the Automobile area, isn't it?",
        "The Business or Domain of the dealer development project is in the Automobile area, isn't it?",
        "The Business or Domain of this dealer is in the Automobile area, isn't it?",
        "The Business or Domain of this dealer project is in the Automobile area, isn't it?",
        "The Business or Domain of this dealer development project is in the Automobile area, isn't it?",
        "The Business or Domain of the dealer is in the Automobile field, isn't it?",
        "The Business or Domain of the dealer project is in the Automobile field, isn't it?",
        "The Business or Domain of the dealer development project is in the Automobile field, isn't it?",
        "The Business or Domain of this dealer is in the Automobile field, isn't it?",
        "The Business or Domain of this dealer project is in the Automobile field, isn't it?",
        "The Business or Domain of this dealer development project is in the Automobile field, isn't it?",
        "The Business or Domain of the dealer is in the Automobile industry, isn't it?",
        "The Business or Domain of the dealer project is in the Automobile industry, isn't it?",
        "The Business or Domain of the dealer development project is in the Automobile industry, isn't it?",
        "The Business or Domain of this dealer is in the Automobile industry, isn't it?",
        "The Business or Domain of this dealer project is in the Automobile industry, isn't it?",
        "The Business or Domain of this dealer development project is in the Automobile industry, isn't it?",
        "Is the Business or Domain of the dealer in the Automobile area?",
        "Is the Business or Domain of the dealer project in the Automobile area?",
        "Is the Business or Domain of the dealer development project in the Automobile area?",
        "Is the Business or Domain of this dealer in the Automobile area?",
        "Is the Business or Domain of this dealer project in the Automobile area?",
        "Is the Business or Domain of this dealer development project in the Automobile area?",
        "Is the Business or Domain of the dealer in the Automobile field?",
        "Is the Business or Domain of the dealer project in the Automobile field?",
        "Is the Business or Domain of the dealer development project in the Automobile field?",
        "Is the Business or Domain of this dealer in the Automobile field?",
        "Is the Business or Domain of this dealer project in the Automobile field?",
        "Is the Business or Domain of this dealer development project in the Automobile field?",
        "Is the Business or Domain of the dealer in the Automobile industry?",
        "Is the Business or Domain of the dealer project in the Automobile industry?",
        "Is the Business or Domain of the dealer development project in the Automobile industry?",
        "Is the Business or Domain of this dealer in the Automobile industry?",
        "Is the Business or Domain of this dealer project in the Automobile industry?",
        "Is the Business or Domain of this dealer development project in the Automobile industry?",
        "Does the Business or Domain of the dealer belong to the Automobile area?",
        "Does the Business or Domain of the dealer project belong to the Automobile area?",
        "Does the Business or Domain of the dealer development project belong to the Automobile area?",
        "Does the Business or Domain of this dealer belong to the Automobile?",
        "Does the Business or Domain of this dealer project belong to the Automobile?",
        "Does the Business or Domain of this dealer development project belong to the Automobile?",
        "Does the Business or Domain of the dealer belong to the Automobile area?",
        "Does the Business or Domain of the dealer project belong to the Automobile area?",
        "Does the Business or Domain of the dealer development project belong to the Automobile area?",
        "Does the Business or Domain of this dealer belong to the Automobile area?",
        "Does the Business or Domain of this dealer project belong to the Automobile area?",
        "Does the Business or Domain of this dealer development project belong to the Automobile area?",
        "Does the Business or Domain of the dealer belong to the Automobile field?",
        "Does the Business or Domain of the dealer project belong to the Automobile field?",
        "Does the Business or Domain of the dealer development project belong to the Automobile field?",
        "Does the Business or Domain of this dealer belong to the Automobile field?",
        "Does the Business or Domain of this dealer project belong to the Automobile field?",
        "Does the Business or Domain of this dealer development project belong to the Automobile field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the dealer development project belong to Automobile.",
        "Its domain is about Automobile.",
        "It provides Automobile industry.",
        "The company is classified in the Automobile industry?"
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealer_site",
      "patterns": [
        "I want to know more information about dealer?",
        "Show me dealer's page?",
        "dealer's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://dealer.com/.",
        "Follow this link: https://dealer.com/."
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealer_start_date",
      "patterns": [
        "When was the contract between dealer and KMS signed?",
        "How long has dealer been our customer?",
        "What was the first date of dealer?",
        "Is the started date of the dealer in Mar 26, 2018?",
        "Was the dealer started in Mar 26, 2018?",
        "The dealer was started in Mar 26, 2018, wasn't it?",
        "In Mar 26, 2018, was the dealer started?",
        "Is the started date of the dealer project in Mar 26, 2018?",
        "Was the dealer project started in Mar 26, 2018?",
        "The dealer project was started in Mar 26, 2018, wasn't it?",
        "In Mar 26, 2018, was the dealer project started?",
        "Is the started date of the dealer development project in Mar 26, 2018?",
        "Was the dealer development project started in Mar 26, 2018?",
        "The dealer development project was started in Mar 26, 2018, wasn't it?",
        "In Mar 26, 2018, was the dealer development project started?",
        "when did the dealer start?",
        "when did the dealer begin?",
        "when did the dealer commence?",
        "when did the dealer initiate?",
        "when did the dealer project start?",
        "when did the dealer project begin?",
        "when did the dealer project commence?",
        "when did the dealer project initiate?",
        "when did the dealer development project start?",
        "when did the dealer development project begin?",
        "when did the dealer development project commence?",
        "when did the dealer development project initiate?",
        "when did this dealer start?",
        "when did this dealer begin?",
        "when did this dealer commence?",
        "when did this dealer initiate?",
        "when did this dealer project start?",
        "when did this dealer project begin?",
        "when did this dealer project commence?",
        "when did this dealer project initiate?",
        "when did this dealer development project start?",
        "when did this dealer development project begin?",
        "when did this dealer development project commence?",
        "when did this dealer development project initiate?",
        "what was the date the dealer started?",
        "what was the date the dealer begun?",
        "what was the date the dealer commenced?",
        "what was the date the dealer intiated?",
        "what was the date the dealer project started?",
        "what was the date the dealer project begun?",
        "what was the date the dealer project commenced?",
        "what was the date the dealer project intiated?",
        "what was the date the dealer development project started?",
        "what was the date the dealer development project begun?",
        "what was the date the dealer development project commenced?",
        "what was the date the dealer development project intiated?",
        "what was the date this dealer project started?",
        "what was the date this dealer project begun?",
        "what was the date this dealer project commenced?",
        "what was the date this dealer project intiated?",
        "what was the date this dealer development project started?",
        "what was the date this dealer development project begun?",
        "what was the date this dealer development project commenced?",
        "what was the date this dealer development project intiated?"
      ],
      "responses": [
        "Yes, The started date of dealer development project is Mar 26, 2018.",
        "It was on Mar 26, 2018",
        "Since Mar 26, 2018"
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealer_member",
      "patterns": [
        "Does dealer have many people work for it?",
        "Tell me the size of dealer team",
        "Are there 5 members in the dealer?",
        "Are there 5 members in the dealer project?",
        "Are there 5 members in the dealer development project?",
        "Are there 5 members in this dealer?",
        "Are there 5 members in this dealer project?",
        "Are there 5 members in this dealer development project?",
        "Are there 5 members in the dealer?",
        "Are there 5 members in the dealer project?",
        "Are there 5 members in the dealer development project?",
        "Are there 5 members in this dealer?",
        "Are there 5 members in this dealer project?",
        "Are there 5 members in this dealer development project?",
        "There are 5 members in the dealer, are not there?",
        "There are 5 members in the dealer project, are not there?",
        "There are 5 members in the dealer development project, are not there?",
        "There are 5 members in this dealer, are not there?",
        "There are 5 members in this dealer project, are not there?",
        "There are 5 members in this dealer development project, are not there?",
        "There are 5 members in the dealer, aren't there?",
        "There are 5 members in the dealer project, aren't there?",
        "There are 5 members in the dealer development project, aren't there?",
        "There are 5 members in this dealer, are not there?",
        "There are 5 members in this dealer project, are not there?",
        "There are 5 members in this dealer development project, are not there?",
        "How many people in the dealer?",
        "How many people in the dealer project?",
        "How many people in the dealer development project?",
        "How many people in this dealer?",
        "How many people in this dealer project?",
        "How many people in this dealer development project?",
        "How many members in the dealer?",
        "How many members in the dealer project?",
        "How many members in the dealer development project?",
        "How many members in this dealer?",
        "How many members in this dealer project?",
        "How many members in this dealer development project?",
        "How many persons in the dealer?",
        "How many persons in the dealer project?",
        "How many persons in the dealer development project?",
        "How many persons in this dealer?",
        "How many persons in this dealer project?",
        "How many persons in this dealer development project?",
        "How about team size of the dealer?",
        "How about team size of the dealer project?",
        "How about team size of the dealer development project?",
        "How about team size of this dealer?",
        "How about team size of this dealer project?",
        "How about team size of this dealer development project?",
        "How about team size in the dealer?",
        "How about team size in the dealer project?",
        "How about team size in the dealer development project?",
        "How about team size in this dealer?",
        "How about team size in this dealer project?",
        "How about team size in this dealer development project?",
        "How many people in the dealer?",
        "How many people in the dealer project?",
        "How many people in the dealer development project?",
        "How many people in this dealer?",
        "How many people in this dealer project?",
        "How many people in this dealer development project?",
        "How many members in the dealer?",
        "How many members in the dealer project?",
        "How many members in the dealer development project?",
        "How many members in this dealer?",
        "How many members in this dealer project?",
        "How many members in this dealer development project?",
        "How many persons in the dealer?",
        "How many persons in the dealer project?",
        "How many persons in the dealer development project?",
        "How many persons in this dealer?",
        "How many persons in this dealer project?",
        "How many persons in this dealer development project?",
        "How about team size of the dealer?",
        "How about team size of the dealer project?",
        "How about team size of the dealer development project?",
        "How about team size of this dealer?",
        "How about team size of this dealer project?",
        "How about team size of this dealer development project?",
        "How about team size in the dealer?",
        "How about team size in the dealer project?",
        "How about team size in the dealer development project?",
        "How about team size in this dealer?",
        "How about team size in this dealer project?",
        "How about team size in this dealer development project?"
      ],
      "responses": [
        "Yes, there are 5 members in the dealer development project.",
        "It is a group of 5 members",
        "The team size is 5",
        "dealer is currently working well with 5 people"
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealer_location",
      "patterns": [
        "How about the location of the dealer in TV office?",
        "How about the location of the dealer project  in TV office?",
        "How about the location of the dealer development project  in TV office?",
        "How about the location of this dealer in TV office?",
        "How about the location of this dealer project in TV office?",
        "How about the location of this dealer development project in TV office?",
        "What is the location of dealer?",
        "Where can I find dealer?",
        "How to meet dealer team?"
      ],
      "responses": [
        "You can find the dealer working space at 5th floor - TV office",
        "Do you intend to ask about the dealer's headquarters",
        "It's 1 Howard St, Burlington, VT 05401, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 5th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 5."
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "dealerFavoriteActivities",
      "patterns": [
        "What do dealer team like to do?",
        "Which activities do dealer enjoy together?",
        "Favorite stuffs dealer do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "Eat all the time and Sweet people eat sweet things",
        "A member of Tuyet Tinh Cox (Cox Automotive Client), The Standard of Beauty, You can call us dear (sweet people) - dear is short for dealer..."
      ],
      "context_filter": "dealer"
    },
    {
      "tag": "carelogistics",
      "patterns": [
        "What is the carelogistics?",
        "What is the carelogistics project?",
        "What is the carelogistics test project?",
        "What is this carelogistics?",
        "What is this carelogistics project?",
        "What is this carelogistics test project?",
        "What is the carelogistics in BU A+?",
        "What is the carelogistics project in BU A+?",
        "What is the carelogistics test project?",
        "What is this carelogistics in BU A+?",
        "What is this carelogistics project in BU A+?",
        "What is this carelogistics test project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a test project in BU A+",
        "Yes, this is one of test projects in BU A+"
      ],
      "context_set": "carelogistics"
    },
    {
      "tag": "carelogistics_office",
      "patterns": [
        "What is the carelogistics customer address?",
        "What is the addresss of owner carelogistics customer?",
        "What is the addresss of carelogistics owner?"
      ],
      "responses": [
        "Yes, the carelogistics customer is a USA customer. His address is: 2655 Northwinds Pkwy, Alpharetta, GA 30009, USA"
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogistics_domain",
      "patterns": [
        "Which industry does carelogistics work in?",
        "Which field is carelogistics about?",
        "Which industry does carelogistics work in?",
        "Which field is carelogistics about?",
        "carelogistics's business domain?",
        "What's the carelogistics's Business/Domain?",
        "What's the carelogistics project 's Business/Domain?",
        "What's the carelogistics test project 's Business/Domain?",
        "What's this carelogistics's Business/Domain?",
        "What's this carelogistics project 's Business/Domain?",
        "What's this carelogistics test project 's Business/Domain?",
        "What is the carelogistics's Business/Domain?",
        "What is the carelogistics project 's Business or Domain?",
        "What is the carelogistics test project 's Business or Domain?",
        "What is this carelogistics's Business or Domain?",
        "What is this carelogistics project 's Business or Domain?",
        "What is this carelogistics test project 's Business or Domain?",
        "What's the carelogistics Business or Domain?",
        "What's the carelogistics project Business or Domain?",
        "What's the carelogistics test project Business or Domain?",
        "What is this carelogistics Business or Domain?",
        "What is this carelogistics project Business or Domain?",
        "What is this carelogistics test project Business or Domain?",
        "What is the Business or Domain of the carelogistics?",
        "What is the Business or Domain of the carelogistics project?",
        "What is the Business or Domain of the carelogistics test project?",
        "What is the Business or Domain of this carelogistics?",
        "What is the Business or Domain of this carelogistics project?",
        "What is the Business or Domain of this carelogistics test project?",
        "The Business or Domain of the carelogistics belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the carelogistics project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the carelogistics test project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this carelogistics belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this carelogistics project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of this carelogistics test project belongs to the Healthcare area, doesn't it?",
        "The Business or Domain of the carelogistics belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the carelogistics project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the carelogistics test project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this carelogistics belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this carelogistics project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of this carelogistics test project belongs to the Healthcare field, doesn't it?",
        "The Business or Domain of the carelogistics belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the carelogistics project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the carelogistics test project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this carelogistics belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this carelogistics project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of this carelogistics test project belongs to the Healthcare industry, doesn't it?",
        "The Business or Domain of the carelogistics is in the Healthcare area, isn't it?",
        "The Business or Domain of the carelogistics project is in the Healthcare area, isn't it?",
        "The Business or Domain of the carelogistics test project is in the Healthcare area, isn't it?",
        "The Business or Domain of this carelogistics is in the Healthcare area, isn't it?",
        "The Business or Domain of this carelogistics project is in the Healthcare area, isn't it?",
        "The Business or Domain of this carelogistics test project is in the Healthcare area, isn't it?",
        "The Business or Domain of the carelogistics is in the Healthcare field, isn't it?",
        "The Business or Domain of the carelogistics project is in the Healthcare field, isn't it?",
        "The Business or Domain of the carelogistics test project is in the Healthcare field, isn't it?",
        "The Business or Domain of this carelogistics is in the Healthcare field, isn't it?",
        "The Business or Domain of this carelogistics project is in the Healthcare field, isn't it?",
        "The Business or Domain of this carelogistics test project is in the Healthcare field, isn't it?",
        "The Business or Domain of the carelogistics is in the Healthcare industry, isn't it?",
        "The Business or Domain of the carelogistics project is in the Healthcare industry, isn't it?",
        "The Business or Domain of the carelogistics test project is in the Healthcare industry, isn't it?",
        "The Business or Domain of this carelogistics is in the Healthcare industry, isn't it?",
        "The Business or Domain of this carelogistics project is in the Healthcare industry, isn't it?",
        "The Business or Domain of this carelogistics test project is in the Healthcare industry, isn't it?",
        "Is the Business or Domain of the carelogistics in the Healthcare area?",
        "Is the Business or Domain of the carelogistics project in the Healthcare area?",
        "Is the Business or Domain of the carelogistics test project in the Healthcare area?",
        "Is the Business or Domain of this carelogistics in the Healthcare area?",
        "Is the Business or Domain of this carelogistics project in the Healthcare area?",
        "Is the Business or Domain of this carelogistics test project in the Healthcare area?",
        "Is the Business or Domain of the carelogistics in the Healthcare field?",
        "Is the Business or Domain of the carelogistics project in the Healthcare field?",
        "Is the Business or Domain of the carelogistics test project in the Healthcare field?",
        "Is the Business or Domain of this carelogistics in the Healthcare field?",
        "Is the Business or Domain of this carelogistics project in the Healthcare field?",
        "Is the Business or Domain of this carelogistics test project in the Healthcare field?",
        "Is the Business or Domain of the carelogistics in the Healthcare industry?",
        "Is the Business or Domain of the carelogistics project in the Healthcare industry?",
        "Is the Business or Domain of the carelogistics test project in the Healthcare industry?",
        "Is the Business or Domain of this carelogistics in the Healthcare industry?",
        "Is the Business or Domain of this carelogistics project in the Healthcare industry?",
        "Is the Business or Domain of this carelogistics test project in the Healthcare industry?",
        "Does the Business or Domain of the carelogistics belong to the Healthcare area?",
        "Does the Business or Domain of the carelogistics project belong to the Healthcare area?",
        "Does the Business or Domain of the carelogistics test project belong to the Healthcare area?",
        "Does the Business or Domain of this carelogistics belong to the Healthcare?",
        "Does the Business or Domain of this carelogistics project belong to the Healthcare?",
        "Does the Business or Domain of this carelogistics test project belong to the Healthcare?",
        "Does the Business or Domain of the carelogistics belong to the Healthcare area?",
        "Does the Business or Domain of the carelogistics project belong to the Healthcare area?",
        "Does the Business or Domain of the carelogistics test project belong to the Healthcare area?",
        "Does the Business or Domain of this carelogistics belong to the Healthcare area?",
        "Does the Business or Domain of this carelogistics project belong to the Healthcare area?",
        "Does the Business or Domain of this carelogistics test project belong to the Healthcare area?",
        "Does the Business or Domain of the carelogistics belong to the Healthcare field?",
        "Does the Business or Domain of the carelogistics project belong to the Healthcare field?",
        "Does the Business or Domain of the carelogistics test project belong to the Healthcare field?",
        "Does the Business or Domain of this carelogistics belong to the Healthcare field?",
        "Does the Business or Domain of this carelogistics project belong to the Healthcare field?",
        "Does the Business or Domain of this carelogistics test project belong to the Healthcare field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the carelogistics test project belong to Healthcare field.",
        "Its domain is about Healthcare",
        "It provides products and services in Healthcare Industry.",
        "The company is classified in the Healthcare industry?"
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogistics_site",
      "patterns": [
        "I want to know more information about carelogistics?",
        "Show me carelogistics's page?",
        "carelogistics's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://www.carelogistics.com/.",
        "Follow this link: https://www.carelogistics.com/."
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogistics_start_date",
      "patterns": [
        "When was the contract between carelogistics and KMS signed?",
        "How long has carelogistics been our customer?",
        "What was the first date of carelogistics?",
        "Is the started date of the carelogistics in August 2014?",
        "Was the carelogistics started in August 2014?",
        "The carelogistics was started in August 2014, wasn't it?",
        "In August 2014, was the carelogistics started?",
        "Is the started date of the carelogistics project in August 2014?",
        "Was the carelogistics project started in August 2014?",
        "The carelogistics project was started in August 2014, wasn't it?",
        "In August 2014, was the carelogistics project started?",
        "Is the started date of the carelogistics test project in August 2014?",
        "Was the carelogistics test project started in August 2014?",
        "The carelogistics test project was started in August 2014, wasn't it?",
        "In August 2014, was the carelogistics test project started?",
        "when did the carelogistics start?",
        "when did the carelogistics begin?",
        "when did the carelogistics commence?",
        "when did the carelogistics initiate?",
        "when did the carelogistics project start?",
        "when did the carelogistics project begin?",
        "when did the carelogistics project commence?",
        "when did the carelogistics project initiate?",
        "when did the carelogistics test project start?",
        "when did the carelogistics test project begin?",
        "when did the carelogistics test project commence?",
        "when did the carelogistics test project initiate?",
        "when did this carelogistics start?",
        "when did this carelogistics begin?",
        "when did this carelogistics commence?",
        "when did this carelogistics initiate?",
        "when did this carelogistics project start?",
        "when did this carelogistics project begin?",
        "when did this carelogistics project commence?",
        "when did this carelogistics project initiate?",
        "when did this carelogistics test project start?",
        "when did this carelogistics test project begin?",
        "when did this carelogistics test project commence?",
        "when did this carelogistics test project initiate?",
        "what was the date the carelogistics started?",
        "what was the date the carelogistics begun?",
        "what was the date the carelogistics commenced?",
        "what was the date the carelogistics intiated?",
        "what was the date the carelogistics project started?",
        "what was the date the carelogistics project begun?",
        "what was the date the carelogistics project commenced?",
        "what was the date the carelogistics project intiated?",
        "what was the date the carelogistics test project started?",
        "what was the date the carelogistics test project begun?",
        "what was the date the carelogistics test project commenced?",
        "what was the date the carelogistics test project intiated?",
        "what was the date this carelogistics project started?",
        "what was the date this carelogistics project begun?",
        "what was the date this carelogistics project commenced?",
        "what was the date this carelogistics project intiated?",
        "what was the date this carelogistics test project started?",
        "what was the date this carelogistics test project begun?",
        "what was the date this carelogistics test project commenced?",
        "what was the date this carelogistics test project intiated?"
      ],
      "responses": [
        "Yes, The started date of carelogistics test project is August 2014.",
        "It was on August 2014",
        "Since Aug 2019"
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogistics_member",
      "patterns": [
        "Does carelogistics have many people work for it?",
        "Tell me the size of carelogistics team",
        "Are there 6 members in the carelogistics?",
        "Are there 6 members in the carelogistics project?",
        "Are there 6 members in the carelogistics test project?",
        "Are there 6 members in this carelogistics?",
        "Are there 6 members in this carelogistics project?",
        "Are there 6 members in this carelogistics test project?",
        "Are there 6 QA members in the carelogistics?",
        "Are there 6 QA members in the carelogistics project?",
        "Are there 6 QA members in the carelogistics test project?",
        "Are there 6 QA members in this carelogistics?",
        "Are there 6 QA members in this carelogistics project?",
        "Are there 6 QA members in this carelogistics test project?",
        "There are 6 QA members in the carelogistics, are not there?",
        "There are 6 QA members in the carelogistics project, are not there?",
        "There are 6 QA members in the carelogistics test project, are not there?",
        "There are 6 QA members in this carelogistics, are not there?",
        "There are 6 QA members in this carelogistics project, are not there?",
        "There are 6 QA members in this carelogistics test project, are not there?",
        "There are 6 QA members in the carelogistics, aren't there?",
        "There are 6 QA members in the carelogistics project, aren't there?",
        "There are 6 QA members in the carelogistics test project, aren't there?",
        "There are 6 QA members in this carelogistics, are not there?",
        "There are 6 QA members in this carelogistics project, are not there?",
        "There are 6 QA members in this carelogistics test project, are not there?",
        "How many people in the carelogistics?",
        "How many people in the carelogistics project?",
        "How many people in the carelogistics test project?",
        "How many people in this carelogistics?",
        "How many people in this carelogistics project?",
        "How many people in this carelogistics test project?",
        "How many members in the carelogistics?",
        "How many members in the carelogistics project?",
        "How many members in the carelogistics test project?",
        "How many members in this carelogistics?",
        "How many members in this carelogistics project?",
        "How many members in this carelogistics test project?",
        "How many persons in the carelogistics?",
        "How many persons in the carelogistics project?",
        "How many persons in the carelogistics test project?",
        "How many persons in this carelogistics?",
        "How many persons in this carelogistics project?",
        "How many persons in this carelogistics test project?",
        "How about team size of the carelogistics?",
        "How about team size of the carelogistics project?",
        "How about team size of the carelogistics test project?",
        "How about team size of this carelogistics?",
        "How about team size of this carelogistics project?",
        "How about team size of this carelogistics test project?",
        "How about team size in the carelogistics?",
        "How about team size in the carelogistics project?",
        "How about team size in the carelogistics test project?",
        "How about team size in this carelogistics?",
        "How about team size in this carelogistics project?",
        "How about team size in this carelogistics test project?",
        "How many QA people in the carelogistics?",
        "How many QA people in the carelogistics project?",
        "How many QA people in the carelogistics test project?",
        "How many QA people in this carelogistics?",
        "How many QA people in this carelogistics project?",
        "How many QA people in this carelogistics test project?",
        "How many QA members in the carelogistics?",
        "How many QA members in the carelogistics project?",
        "How many QA members in the carelogistics test project?",
        "How many QA members in this carelogistics?",
        "How many QA members in this carelogistics project?",
        "How many QA members in this carelogistics test project?",
        "How many QA persons in the carelogistics?",
        "How many QA persons in the carelogistics project?",
        "How many QA persons in the carelogistics test project?",
        "How many QA persons in this carelogistics?",
        "How many QA persons in this carelogistics project?",
        "How many QA persons in this carelogistics test project?",
        "How about QA team size of the carelogistics?",
        "How about QA team size of the carelogistics project?",
        "How about QA team size of the carelogistics test project?",
        "How about QA team size of this carelogistics?",
        "How about QA team size of this carelogistics project?",
        "How about QA team size of this carelogistics test project?",
        "How about QA team size in the carelogistics?",
        "How about QA team size in the carelogistics project?",
        "How about QA team size in the carelogistics test project?",
        "How about QA team size in this carelogistics?",
        "How about QA team size in this carelogistics project?",
        "How about QA team size in this carelogistics test project?"
      ],
      "responses": [
        "Yes, there are 6 QA members in the carelogistics test project.",
        "It is a group of 6 members",
        "The team size is 6",
        "carelogistics is currently working well with 6 people"
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogistics_location",
      "patterns": [
        "How about the location of the carelogistics in TV office?",
        "How about the location of the carelogistics project  in TV office?",
        "How about the location of the carelogistics test project  in TV office?",
        "How about the location of this carelogistics in TV office?",
        "How about the location of this carelogistics project in TV office?",
        "How about the location of this carelogistics test project in TV office?",
        "What is the location of carelogistics?",
        "Where can I find carelogistics?",
        "How to meet carelogistics team?"
      ],
      "responses": [
        "You can find the carelogistics working space at 4th floor - TV office",
        "Do you intend to ask about the carelogistics's headquarters",
        "It's 2655 Northwinds Pkwy, Alpharetta, GA 30009, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "carelogisticsFavoriteActivities",
      "patterns": [
        "What do carelogistics team like to do?",
        "Which activities do carelogistics enjoy together?",
        "Favorite stuffs carelogistics do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "The team'd love going out for drinking bubble tea & eating food.",
        "all members are freshers",
        "They enjoy spending time for drinking, singing as well as exploring new technology"
      ],
      "context_filter": "carelogistics"
    },
    {
      "tag": "monetate",
      "patterns": [
        "What is the monetate?",
        "What is the monetate project?",
        "What is the monetate test project?",
        "What is this monetate?",
        "What is this monetate project?",
        "What is this monetate test project?",
        "What is the monetate in BU A+?",
        "What is the monetate project in BU A+?",
        "What is the monetate test project?",
        "What is this monetate in BU A+?",
        "What is this monetate project in BU A+?",
        "What is this monetate test project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a test project in BU A+",
        "Yes, this is one of test projects in BU A+"
      ],
      "context_set": "monetate"
    },
    {
      "tag": "monetate_office",
      "patterns": [
        "What is the monetate customer address?",
        "What is the addresss of owner monetate customer?",
        "What is the addresss of monetate owner?"
      ],
      "responses": [
        "Yes, the monetate customer is a USA customer. His address is: 27 E 28th St 8th Floor, New York, NY 10016, USA"
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetate_domain",
      "patterns": [
        "Which industry does monetate work in?",
        "Which field is monetate about?",
        "Which industry does monetate work in?",
        "Which field is monetate about?",
        "monetate's business domain?",
        "What's the monetate's Business/Domain?",
        "What's the monetate project 's Business/Domain?",
        "What's the monetate test project 's Business/Domain?",
        "What's this monetate's Business/Domain?",
        "What's this monetate project 's Business/Domain?",
        "What's this monetate test project 's Business/Domain?",
        "What is the monetate's Business/Domain?",
        "What is the monetate project 's Business or Domain?",
        "What is the monetate test project 's Business or Domain?",
        "What is this monetate's Business or Domain?",
        "What is this monetate project 's Business or Domain?",
        "What is this monetate test project 's Business or Domain?",
        "What's the monetate Business or Domain?",
        "What's the monetate project Business or Domain?",
        "What's the monetate test project Business or Domain?",
        "What is this monetate Business or Domain?",
        "What is this monetate project Business or Domain?",
        "What is this monetate test project Business or Domain?",
        "What is the Business or Domain of the monetate?",
        "What is the Business or Domain of the monetate project?",
        "What is the Business or Domain of the monetate test project?",
        "What is the Business or Domain of this monetate?",
        "What is the Business or Domain of this monetate project?",
        "What is the Business or Domain of this monetate test project?",
        "The Business or Domain of the monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of the monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of the monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of this monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of this monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of this monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, doesn't it?",
        "The Business or Domain of the monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of the monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of the monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of this monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of this monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of this monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, doesn't it?",
        "The Business or Domain of the monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of the monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of the monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of this monetate belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of this monetate project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of this monetate test project belongs to the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, doesn't it?",
        "The Business or Domain of the monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of the monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of the monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of this monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of this monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of this monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area, isn't it?",
        "The Business or Domain of the monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of the monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of the monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of this monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of this monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of this monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field, isn't it?",
        "The Business or Domain of the monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "The Business or Domain of the monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "The Business or Domain of the monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "The Business or Domain of this monetate is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "The Business or Domain of this monetate project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "The Business or Domain of this monetate test project is in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry, isn't it?",
        "Is the Business or Domain of the monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of the monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of the monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of this monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of this monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of this monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Is the Business or Domain of the monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of the monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of the monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of this monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of this monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of this monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Is the Business or Domain of the monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Is the Business or Domain of the monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Is the Business or Domain of the monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Is the Business or Domain of this monetate in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Is the Business or Domain of this monetate project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Is the Business or Domain of this monetate test project in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?",
        "Does the Business or Domain of the monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of the monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of the monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of this monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement?",
        "Does the Business or Domain of this monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement?",
        "Does the Business or Domain of this monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement?",
        "Does the Business or Domain of the monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of the monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of the monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of this monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of this monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of this monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement area?",
        "Does the Business or Domain of the monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Does the Business or Domain of the monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Does the Business or Domain of the monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Does the Business or Domain of this monetate belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Does the Business or Domain of this monetate project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?",
        "Does the Business or Domain of this monetate test project belong to the Marketing Platform, Enterprise Software, Internet, Test and Measurement field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the monetate test project belong to Marketing Platform, Enterprise Software, Internet, Test and Measurement field.",
        "Its domain is about Marketing Platform, Enterprise Software, Internet, Test and Measurement",
        "It provides products and services in Marketing Platform, Enterprise Software, Internet, Test and Measurement Industry.",
        "The company is classified in the Marketing Platform, Enterprise Software, Internet, Test and Measurement industry?"
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetate_site",
      "patterns": [
        "I want to know more information about monetate?",
        "Show me monetate's page?",
        "monetate's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://monetate.com/.",
        "Follow this link: https://monetate.com/."
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetate_start_date",
      "patterns": [
        "When was the contract between monetate and KMS signed?",
        "How long has monetate been our customer?",
        "What was the first date of monetate?",
        "Is the started date of the monetate in Oct 22, 2018?",
        "Was the monetate started in Oct 22, 2018?",
        "The monetate was started in Oct 22, 2018, wasn't it?",
        "In Oct 22, 2018, was the monetate started?",
        "Is the started date of the monetate project in Oct 22, 2018?",
        "Was the monetate project started in Oct 22, 2018?",
        "The monetate project was started in Oct 22, 2018, wasn't it?",
        "In Oct 22, 2018, was the monetate project started?",
        "Is the started date of the monetate test project in Oct 22, 2018?",
        "Was the monetate test project started in Oct 22, 2018?",
        "The monetate test project was started in Oct 22, 2018, wasn't it?",
        "In Oct 22, 2018, was the monetate test project started?",
        "when did the monetate start?",
        "when did the monetate begin?",
        "when did the monetate commence?",
        "when did the monetate initiate?",
        "when did the monetate project start?",
        "when did the monetate project begin?",
        "when did the monetate project commence?",
        "when did the monetate project initiate?",
        "when did the monetate test project start?",
        "when did the monetate test project begin?",
        "when did the monetate test project commence?",
        "when did the monetate test project initiate?",
        "when did this monetate start?",
        "when did this monetate begin?",
        "when did this monetate commence?",
        "when did this monetate initiate?",
        "when did this monetate project start?",
        "when did this monetate project begin?",
        "when did this monetate project commence?",
        "when did this monetate project initiate?",
        "when did this monetate test project start?",
        "when did this monetate test project begin?",
        "when did this monetate test project commence?",
        "when did this monetate test project initiate?",
        "what was the date the monetate started?",
        "what was the date the monetate begun?",
        "what was the date the monetate commenced?",
        "what was the date the monetate intiated?",
        "what was the date the monetate project started?",
        "what was the date the monetate project begun?",
        "what was the date the monetate project commenced?",
        "what was the date the monetate project intiated?",
        "what was the date the monetate test project started?",
        "what was the date the monetate test project begun?",
        "what was the date the monetate test project commenced?",
        "what was the date the monetate test project intiated?",
        "what was the date this monetate project started?",
        "what was the date this monetate project begun?",
        "what was the date this monetate project commenced?",
        "what was the date this monetate project intiated?",
        "what was the date this monetate test project started?",
        "what was the date this monetate test project begun?",
        "what was the date this monetate test project commenced?",
        "what was the date this monetate test project intiated?"
      ],
      "responses": [
        "Yes, The started date of monetate test project is Oct 22, 2018.",
        "It was on Oct 22, 2018",
        "Since Oct 22, 2018"
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetate_member",
      "patterns": [
        "Does monetate have many people work for it?",
        "Tell me the size of monetate team",
        "Are there 3 members in the monetate?",
        "Are there 3 members in the monetate project?",
        "Are there 3 members in the monetate test project?",
        "Are there 3 members in this monetate?",
        "Are there 3 members in this monetate project?",
        "Are there 3 members in this monetate test project?",
        "Are there 3 QA members in the monetate?",
        "Are there 3 QA members in the monetate project?",
        "Are there 3 QA members in the monetate test project?",
        "Are there 3 QA members in this monetate?",
        "Are there 3 QA members in this monetate project?",
        "Are there 3 QA members in this monetate test project?",
        "There are 3 QA members in the monetate, are not there?",
        "There are 3 QA members in the monetate project, are not there?",
        "There are 3 QA members in the monetate test project, are not there?",
        "There are 3 QA members in this monetate, are not there?",
        "There are 3 QA members in this monetate project, are not there?",
        "There are 3 QA members in this monetate test project, are not there?",
        "There are 3 QA members in the monetate, aren't there?",
        "There are 3 QA members in the monetate project, aren't there?",
        "There are 3 QA members in the monetate test project, aren't there?",
        "There are 3 QA members in this monetate, are not there?",
        "There are 3 QA members in this monetate project, are not there?",
        "There are 3 QA members in this monetate test project, are not there?",
        "How many people in the monetate?",
        "How many people in the monetate project?",
        "How many people in the monetate test project?",
        "How many people in this monetate?",
        "How many people in this monetate project?",
        "How many people in this monetate test project?",
        "How many members in the monetate?",
        "How many members in the monetate project?",
        "How many members in the monetate test project?",
        "How many members in this monetate?",
        "How many members in this monetate project?",
        "How many members in this monetate test project?",
        "How many persons in the monetate?",
        "How many persons in the monetate project?",
        "How many persons in the monetate test project?",
        "How many persons in this monetate?",
        "How many persons in this monetate project?",
        "How many persons in this monetate test project?",
        "How about team size of the monetate?",
        "How about team size of the monetate project?",
        "How about team size of the monetate test project?",
        "How about team size of this monetate?",
        "How about team size of this monetate project?",
        "How about team size of this monetate test project?",
        "How about team size in the monetate?",
        "How about team size in the monetate project?",
        "How about team size in the monetate test project?",
        "How about team size in this monetate?",
        "How about team size in this monetate project?",
        "How about team size in this monetate test project?",
        "How many QA people in the monetate?",
        "How many QA people in the monetate project?",
        "How many QA people in the monetate test project?",
        "How many QA people in this monetate?",
        "How many QA people in this monetate project?",
        "How many QA people in this monetate test project?",
        "How many QA members in the monetate?",
        "How many QA members in the monetate project?",
        "How many QA members in the monetate test project?",
        "How many QA members in this monetate?",
        "How many QA members in this monetate project?",
        "How many QA members in this monetate test project?",
        "How many QA persons in the monetate?",
        "How many QA persons in the monetate project?",
        "How many QA persons in the monetate test project?",
        "How many QA persons in this monetate?",
        "How many QA persons in this monetate project?",
        "How many QA persons in this monetate test project?",
        "How about QA team size of the monetate?",
        "How about QA team size of the monetate project?",
        "How about QA team size of the monetate test project?",
        "How about QA team size of this monetate?",
        "How about QA team size of this monetate project?",
        "How about QA team size of this monetate test project?",
        "How about QA team size in the monetate?",
        "How about QA team size in the monetate project?",
        "How about QA team size in the monetate test project?",
        "How about QA team size in this monetate?",
        "How about QA team size in this monetate project?",
        "How about QA team size in this monetate test project?"
      ],
      "responses": [
        "Yes, there are 3 QA members in the monetate test project.",
        "It is a group of 3 members",
        "The team size is 3",
        "monetate is currently working well with 3 people"
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetate_location",
      "patterns": [
        "How about the location of the monetate in TV office?",
        "How about the location of the monetate project  in TV office?",
        "How about the location of the monetate test project  in TV office?",
        "How about the location of this monetate in TV office?",
        "How about the location of this monetate project in TV office?",
        "How about the location of this monetate test project in TV office?",
        "What is the location of monetate?",
        "Where can I find monetate?",
        "How to meet monetate team?"
      ],
      "responses": [
        "You can find the monetate working space at 4th floor - TV office",
        "Do you intend to ask about the monetate's headquarters",
        "It's 27 E 28th St 8th Floor, New York, NY 10016, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "monetateFavoriteActivities",
      "patterns": [
        "What do monetate team like to do?",
        "Which activities do monetate enjoy together?",
        "Favorite stuffs monetate do in free time?",
        "What do they do in their free time?",
        "Which fun fact do monetate like?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "The team'd love going out for drinking bubble tea & eating food.",
        "They enjoy spending time for working new technology"
      ],
      "context_filter": "monetate"
    },
    {
      "tag": "agreementexpress",
      "patterns": [
        "What is the agreementexpress?",
        "What is the agreementexpress project?",
        "What is the agreementexpress development project?",
        "What is this agreementexpress?",
        "What is this agreementexpress project?",
        "What is this agreementexpress development project?",
        "What is the agreementexpress in BU A+?",
        "What is the agreementexpress project in BU A+?",
        "What is the agreementexpress development project?",
        "What is this agreementexpress in BU A+?",
        "What is this agreementexpress project in BU A+?",
        "What is this agreementexpress development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "agreementexpress"
    },
    {
      "tag": "agreementexpress_office",
      "patterns": [
        "What is the agreementexpress customer address?",
        "What is the addresss of owner agreementexpress customer?",
        "What is the addresss of agreementexpress owner?"
      ],
      "responses": [
        "Yes, the agreementexpress customer is a Canada customer. His address is: 625 Howe St. Suite 900 Vancouver, British Columbia Canada V6C 2T6"
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpress_domain",
      "patterns": [
        "Which industry does agreementexpress work in?",
        "Which field is agreementexpress about?",
        "Which industry does agreementexpress work in?",
        "Which field is agreementexpress about?",
        "agreementexpress's business domain?",
        "What's the agreementexpress's Business/Domain?",
        "What's the agreementexpress project 's Business/Domain?",
        "What's the agreementexpress development project 's Business/Domain?",
        "What's this agreementexpress's Business/Domain?",
        "What's this agreementexpress project 's Business/Domain?",
        "What's this agreementexpress development project 's Business/Domain?",
        "What is the agreementexpress's Business/Domain?",
        "What is the agreementexpress project 's Business or Domain?",
        "What is the agreementexpress development project 's Business or Domain?",
        "What is this agreementexpress's Business or Domain?",
        "What is this agreementexpress project 's Business or Domain?",
        "What is this agreementexpress development project 's Business or Domain?",
        "What's the agreementexpress Business or Domain?",
        "What's the agreementexpress project Business or Domain?",
        "What's the agreementexpress development project Business or Domain?",
        "What is this agreementexpress Business or Domain?",
        "What is this agreementexpress project Business or Domain?",
        "What is this agreementexpress development project Business or Domain?",
        "What is the Business or Domain of the agreementexpress?",
        "What is the Business or Domain of the agreementexpress project?",
        "What is the Business or Domain of the agreementexpress development project?",
        "What is the Business or Domain of this agreementexpress?",
        "What is the Business or Domain of this agreementexpress project?",
        "What is the Business or Domain of this agreementexpress development project?",
        "The Business or Domain of the agreementexpress belongs to the Fintech area, doesn't it?",
        "The Business or Domain of the agreementexpress project belongs to the Fintech area, doesn't it?",
        "The Business or Domain of the agreementexpress development project belongs to the Fintech area, doesn't it?",
        "The Business or Domain of this agreementexpress belongs to the Fintech area, doesn't it?",
        "The Business or Domain of this agreementexpress project belongs to the Fintech area, doesn't it?",
        "The Business or Domain of this agreementexpress development project belongs to the Fintech area, doesn't it?",
        "The Business or Domain of the agreementexpress belongs to the Fintech field, doesn't it?",
        "The Business or Domain of the agreementexpress project belongs to the Fintech field, doesn't it?",
        "The Business or Domain of the agreementexpress development project belongs to the Fintech field, doesn't it?",
        "The Business or Domain of this agreementexpress belongs to the Fintech field, doesn't it?",
        "The Business or Domain of this agreementexpress project belongs to the Fintech field, doesn't it?",
        "The Business or Domain of this agreementexpress development project belongs to the Fintech field, doesn't it?",
        "The Business or Domain of the agreementexpress belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of the agreementexpress project belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of the agreementexpress development project belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of this agreementexpress belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of this agreementexpress project belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of this agreementexpress development project belongs to the Fintech industry, doesn't it?",
        "The Business or Domain of the agreementexpress is in the Fintech area, isn't it?",
        "The Business or Domain of the agreementexpress project is in the Fintech area, isn't it?",
        "The Business or Domain of the agreementexpress development project is in the Fintech area, isn't it?",
        "The Business or Domain of this agreementexpress is in the Fintech area, isn't it?",
        "The Business or Domain of this agreementexpress project is in the Fintech area, isn't it?",
        "The Business or Domain of this agreementexpress development project is in the Fintech area, isn't it?",
        "The Business or Domain of the agreementexpress is in the Fintech field, isn't it?",
        "The Business or Domain of the agreementexpress project is in the Fintech field, isn't it?",
        "The Business or Domain of the agreementexpress development project is in the Fintech field, isn't it?",
        "The Business or Domain of this agreementexpress is in the Fintech field, isn't it?",
        "The Business or Domain of this agreementexpress project is in the Fintech field, isn't it?",
        "The Business or Domain of this agreementexpress development project is in the Fintech field, isn't it?",
        "The Business or Domain of the agreementexpress is in the Fintech industry, isn't it?",
        "The Business or Domain of the agreementexpress project is in the Fintech industry, isn't it?",
        "The Business or Domain of the agreementexpress development project is in the Fintech industry, isn't it?",
        "The Business or Domain of this agreementexpress is in the Fintech industry, isn't it?",
        "The Business or Domain of this agreementexpress project is in the Fintech industry, isn't it?",
        "The Business or Domain of this agreementexpress development project is in the Fintech industry, isn't it?",
        "Is the Business or Domain of the agreementexpress in the Fintech area?",
        "Is the Business or Domain of the agreementexpress project in the Fintech area?",
        "Is the Business or Domain of the agreementexpress development project in the Fintech area?",
        "Is the Business or Domain of this agreementexpress in the Fintech area?",
        "Is the Business or Domain of this agreementexpress project in the Fintech area?",
        "Is the Business or Domain of this agreementexpress development project in the Fintech area?",
        "Is the Business or Domain of the agreementexpress in the Fintech field?",
        "Is the Business or Domain of the agreementexpress project in the Fintech field?",
        "Is the Business or Domain of the agreementexpress development project in the Fintech field?",
        "Is the Business or Domain of this agreementexpress in the Fintech field?",
        "Is the Business or Domain of this agreementexpress project in the Fintech field?",
        "Is the Business or Domain of this agreementexpress development project in the Fintech field?",
        "Is the Business or Domain of the agreementexpress in the Fintech industry?",
        "Is the Business or Domain of the agreementexpress project in the Fintech industry?",
        "Is the Business or Domain of the agreementexpress development project in the Fintech industry?",
        "Is the Business or Domain of this agreementexpress in the Fintech industry?",
        "Is the Business or Domain of this agreementexpress project in the Fintech industry?",
        "Is the Business or Domain of this agreementexpress development project in the Fintech industry?",
        "Does the Business or Domain of the agreementexpress belong to the Fintech area?",
        "Does the Business or Domain of the agreementexpress project belong to the Fintech area?",
        "Does the Business or Domain of the agreementexpress development project belong to the Fintech area?",
        "Does the Business or Domain of this agreementexpress belong to the Fintech?",
        "Does the Business or Domain of this agreementexpress project belong to the Fintech?",
        "Does the Business or Domain of this agreementexpress development project belong to the Fintech?",
        "Does the Business or Domain of the agreementexpress belong to the Fintech area?",
        "Does the Business or Domain of the agreementexpress project belong to the Fintech area?",
        "Does the Business or Domain of the agreementexpress development project belong to the Fintech area?",
        "Does the Business or Domain of this agreementexpress belong to the Fintech area?",
        "Does the Business or Domain of this agreementexpress project belong to the Fintech area?",
        "Does the Business or Domain of this agreementexpress development project belong to the Fintech area?",
        "Does the Business or Domain of the agreementexpress belong to the Fintech field?",
        "Does the Business or Domain of the agreementexpress project belong to the Fintech field?",
        "Does the Business or Domain of the agreementexpress development project belong to the Fintech field?",
        "Does the Business or Domain of this agreementexpress belong to the Fintech field?",
        "Does the Business or Domain of this agreementexpress project belong to the Fintech field?",
        "Does the Business or Domain of this agreementexpress development project belong to the Fintech field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the agreementexpress development project belong toFintech.",
        "Its domain is about Fintech and expertise designed specifically for mid to upper tier retailers.",
        "It provides Fintech and expertise designed specifically for mid to upper tier retailers industry.",
        "The company is classified in the Fintech industry?"
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpress_site",
      "patterns": [
        "I want to know more information about agreementexpress?",
        "Show me agreementexpress's page?",
        "agreementexpress's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://agreementexpress.com/.",
        "Follow this link: https://agreementexpress.com/."
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpress_start_date",
      "patterns": [
        "When was the contract between agreementexpress and KMS signed?",
        "How long has agreementexpress been our customer?",
        "What was the first date of agreementexpress?",
        "Is the started date of the agreementexpress in Sep 16, 1619?",
        "Was the agreementexpress started in Sep 16, 1619?",
        "The agreementexpress was started in Sep 16, 1619, wasn't it?",
        "In Sep 16, 1619, was the agreementexpress started?",
        "Is the started date of the agreementexpress project in Sep 16, 1619?",
        "Was the agreementexpress project started in Sep 16, 1619?",
        "The agreementexpress project was started in Sep 16, 1619, wasn't it?",
        "In Sep 16, 1619, was the agreementexpress project started?",
        "Is the started date of the agreementexpress development project in Sep 16, 1619?",
        "Was the agreementexpress development project started in Sep 16, 1619?",
        "The agreementexpress development project was started in Sep 16, 1619, wasn't it?",
        "In Sep 16, 1619, was the agreementexpress development project started?",
        "when did the agreementexpress start?",
        "when did the agreementexpress begin?",
        "when did the agreementexpress commence?",
        "when did the agreementexpress initiate?",
        "when did the agreementexpress project start?",
        "when did the agreementexpress project begin?",
        "when did the agreementexpress project commence?",
        "when did the agreementexpress project initiate?",
        "when did the agreementexpress development project start?",
        "when did the agreementexpress development project begin?",
        "when did the agreementexpress development project commence?",
        "when did the agreementexpress development project initiate?",
        "when did this agreementexpress start?",
        "when did this agreementexpress begin?",
        "when did this agreementexpress commence?",
        "when did this agreementexpress initiate?",
        "when did this agreementexpress project start?",
        "when did this agreementexpress project begin?",
        "when did this agreementexpress project commence?",
        "when did this agreementexpress project initiate?",
        "when did this agreementexpress development project start?",
        "when did this agreementexpress development project begin?",
        "when did this agreementexpress development project commence?",
        "when did this agreementexpress development project initiate?",
        "what was the date the agreementexpress started?",
        "what was the date the agreementexpress begun?",
        "what was the date the agreementexpress commenced?",
        "what was the date the agreementexpress intiated?",
        "what was the date the agreementexpress project started?",
        "what was the date the agreementexpress project begun?",
        "what was the date the agreementexpress project commenced?",
        "what was the date the agreementexpress project intiated?",
        "what was the date the agreementexpress development project started?",
        "what was the date the agreementexpress development project begun?",
        "what was the date the agreementexpress development project commenced?",
        "what was the date the agreementexpress development project intiated?",
        "what was the date this agreementexpress project started?",
        "what was the date this agreementexpress project begun?",
        "what was the date this agreementexpress project commenced?",
        "what was the date this agreementexpress project intiated?",
        "what was the date this agreementexpress development project started?",
        "what was the date this agreementexpress development project begun?",
        "what was the date this agreementexpress development project commenced?",
        "what was the date this agreementexpress development project intiated?"
      ],
      "responses": [
        "Yes, The started date of agreementexpress development project is Sep 16, 1619.",
        "It was on Sep 16, 1619",
        "Since Sep 16, 1619"
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpress_member",
      "patterns": [
        "Does agreementexpress have many people work for it?",
        "Tell me the size of agreementexpress team",
        "Are there 16 members in the agreementexpress?",
        "Are there 16 members in the agreementexpress project?",
        "Are there 16 members in the agreementexpress development project?",
        "Are there 16 members in this agreementexpress?",
        "Are there 16 members in this agreementexpress project?",
        "Are there 16 members in this agreementexpress development project?",
        "Are there 16 members in the agreementexpress?",
        "Are there 16 members in the agreementexpress project?",
        "Are there 16 members in the agreementexpress development project?",
        "Are there 16 members in this agreementexpress?",
        "Are there 16 members in this agreementexpress project?",
        "Are there 16 members in this agreementexpress development project?",
        "There are 16 members in the agreementexpress, are not there?",
        "There are 16 members in the agreementexpress project, are not there?",
        "There are 16 members in the agreementexpress development project, are not there?",
        "There are 16 members in this agreementexpress, are not there?",
        "There are 16 members in this agreementexpress project, are not there?",
        "There are 16 members in this agreementexpress development project, are not there?",
        "There are 16 members in the agreementexpress, aren't there?",
        "There are 16 members in the agreementexpress project, aren't there?",
        "There are 16 members in the agreementexpress development project, aren't there?",
        "There are 16 members in this agreementexpress, are not there?",
        "There are 16 members in this agreementexpress project, are not there?",
        "There are 16 members in this agreementexpress development project, are not there?",
        "How many people in the agreementexpress?",
        "How many people in the agreementexpress project?",
        "How many people in the agreementexpress development project?",
        "How many people in this agreementexpress?",
        "How many people in this agreementexpress project?",
        "How many people in this agreementexpress development project?",
        "How many members in the agreementexpress?",
        "How many members in the agreementexpress project?",
        "How many members in the agreementexpress development project?",
        "How many members in this agreementexpress?",
        "How many members in this agreementexpress project?",
        "How many members in this agreementexpress development project?",
        "How many persons in the agreementexpress?",
        "How many persons in the agreementexpress project?",
        "How many persons in the agreementexpress development project?",
        "How many persons in this agreementexpress?",
        "How many persons in this agreementexpress project?",
        "How many persons in this agreementexpress development project?",
        "How about team size of the agreementexpress?",
        "How about team size of the agreementexpress project?",
        "How about team size of the agreementexpress development project?",
        "How about team size of this agreementexpress?",
        "How about team size of this agreementexpress project?",
        "How about team size of this agreementexpress development project?",
        "How about team size in the agreementexpress?",
        "How about team size in the agreementexpress project?",
        "How about team size in the agreementexpress development project?",
        "How about team size in this agreementexpress?",
        "How about team size in this agreementexpress project?",
        "How about team size in this agreementexpress development project?",
        "How many people in the agreementexpress?",
        "How many people in the agreementexpress project?",
        "How many people in the agreementexpress development project?",
        "How many people in this agreementexpress?",
        "How many people in this agreementexpress project?",
        "How many people in this agreementexpress development project?",
        "How many members in the agreementexpress?",
        "How many members in the agreementexpress project?",
        "How many members in the agreementexpress development project?",
        "How many members in this agreementexpress?",
        "How many members in this agreementexpress project?",
        "How many members in this agreementexpress development project?",
        "How many persons in the agreementexpress?",
        "How many persons in the agreementexpress project?",
        "How many persons in the agreementexpress development project?",
        "How many persons in this agreementexpress?",
        "How many persons in this agreementexpress project?",
        "How many persons in this agreementexpress development project?",
        "How about team size of the agreementexpress?",
        "How about team size of the agreementexpress project?",
        "How about team size of the agreementexpress development project?",
        "How about team size of this agreementexpress?",
        "How about team size of this agreementexpress project?",
        "How about team size of this agreementexpress development project?",
        "How about team size in the agreementexpress?",
        "How about team size in the agreementexpress project?",
        "How about team size in the agreementexpress development project?",
        "How about team size in this agreementexpress?",
        "How about team size in this agreementexpress project?",
        "How about team size in this agreementexpress development project?"
      ],
      "responses": [
        "Yes, there are 16 members in the agreementexpress development project.",
        "It is a group of 16 members",
        "The team size is 16",
        "agreementexpress is currently working well with 16 people"
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpress_location",
      "patterns": [
        "How about the location of the agreementexpress in TV office?",
        "How about the location of the agreementexpress project  in TV office?",
        "How about the location of the agreementexpress development project  in TV office?",
        "How about the location of this agreementexpress in TV office?",
        "How about the location of this agreementexpress project in TV office?",
        "How about the location of this agreementexpress development project in TV office?",
        "What is the location of agreementexpress?",
        "Where can I find agreementexpress?",
        "How to meet agreementexpress team?"
      ],
      "responses": [
        "You can find the agreementexpress working space at 4th floor - TV office",
        "Do you intend to ask about the agreementexpress's headquarters",
        "It's 625 Howe St. Suite 900 Vancouver, British Columbia Canada V6C 2T6. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 5."
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "agreementexpressFavoriteActivities",
      "patterns": [
        "What do agreementexpress team like to do?",
        "Which activities do agreementexpress enjoy together?",
        "Favorite stuffs agreementexpress do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "the shortest deal ever! Closed won within 10 days."
      ],
      "context_filter": "agreementexpress"
    },
    {
      "tag": "autotrader",
      "patterns": [
        "What is the autotrader?",
        "What is the autotrader project?",
        "What is the autotrader development project?",
        "What is this autotrader?",
        "What is this autotrader project?",
        "What is this autotrader development project?",
        "What is the autotrader in BU A+?",
        "What is the autotrader project in BU A+?",
        "What is the autotrader development project?",
        "What is this autotrader in BU A+?",
        "What is this autotrader project in BU A+?",
        "What is this autotrader development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "autotrader"
    },
    {
      "tag": "autotrader_office",
      "patterns": [
        "What is the autotrader customer address?",
        "What is the addresss of owner autotrader customer?",
        "What is the addresss of autotrader owner?"
      ],
      "responses": [
        "Yes, the autotrader customer is a US customer. His address is: 3003 Summit Blvd NE #200, Atlanta, GA 30319, USA"
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotrader_domain",
      "patterns": [
        "Which industry does autotrader work in?",
        "Which field is autotrader about?",
        "Which industry does autotrader work in?",
        "Which field is autotrader about?",
        "autotrader's business domain?",
        "What's the autotrader's Business or Domain?",
        "What's the autotrader project 's Business or Domain?",
        "What's the autotrader development project 's Business or Domain?",
        "What's this autotrader's Business or Domain?",
        "What's this autotrader project 's Business or Domain?",
        "What's this autotrader development project 's Business or Domain?",
        "What is the autotrader's Business or Domain?",
        "What is the autotrader project 's Business or Domain?",
        "What is the autotrader development project 's Business or Domain?",
        "What is this autotrader's Business or Domain?",
        "What is this autotrader project 's Business or Domain?",
        "What is this autotrader development project 's Business or Domain?",
        "What's the autotrader Business or Domain?",
        "What's the autotrader project Business or Domain?",
        "What's the autotrader development project Business or Domain?",
        "What is this autotrader Business or Domain?",
        "What is this autotrader project Business or Domain?",
        "What is this autotrader development project Business or Domain?",
        "What is the Business or Domain of the autotrader?",
        "What is the Business or Domain of the autotrader project?",
        "What is the Business or Domain of the autotrader development project?",
        "What is the Business or Domain of this autotrader?",
        "What is the Business or Domain of this autotrader project?",
        "What is the Business or Domain of this autotrader development project?",
        "The Business or Domain of the autotrader belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the autotrader project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the autotrader development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this autotrader belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this autotrader project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this autotrader development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the autotrader belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the autotrader project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the autotrader development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this autotrader belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this autotrader project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this autotrader development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the autotrader belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the autotrader project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the autotrader development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this autotrader belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this autotrader project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this autotrader development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the autotrader is in the Automobile area, isn't it?",
        "The Business or Domain of the autotrader project is in the Automobile area, isn't it?",
        "The Business or Domain of the autotrader development project is in the Automobile area, isn't it?",
        "The Business or Domain of this autotrader is in the Automobile area, isn't it?",
        "The Business or Domain of this autotrader project is in the Automobile area, isn't it?",
        "The Business or Domain of this autotrader development project is in the Automobile area, isn't it?",
        "The Business or Domain of the autotrader is in the Automobile field, isn't it?",
        "The Business or Domain of the autotrader project is in the Automobile field, isn't it?",
        "The Business or Domain of the autotrader development project is in the Automobile field, isn't it?",
        "The Business or Domain of this autotrader is in the Automobile field, isn't it?",
        "The Business or Domain of this autotrader project is in the Automobile field, isn't it?",
        "The Business or Domain of this autotrader development project is in the Automobile field, isn't it?",
        "The Business or Domain of the autotrader is in the Automobile industry, isn't it?",
        "The Business or Domain of the autotrader project is in the Automobile industry, isn't it?",
        "The Business or Domain of the autotrader development project is in the Automobile industry, isn't it?",
        "The Business or Domain of this autotrader is in the Automobile industry, isn't it?",
        "The Business or Domain of this autotrader project is in the Automobile industry, isn't it?",
        "The Business or Domain of this autotrader development project is in the Automobile industry, isn't it?",
        "Is the Business or Domain of the autotrader in the Automobile area?",
        "Is the Business or Domain of the autotrader project in the Automobile area?",
        "Is the Business or Domain of the autotrader development project in the Automobile area?",
        "Is the Business or Domain of this autotrader in the Automobile area?",
        "Is the Business or Domain of this autotrader project in the Automobile area?",
        "Is the Business or Domain of this autotrader development project in the Automobile area?",
        "Is the Business or Domain of the autotrader in the Automobile field?",
        "Is the Business or Domain of the autotrader project in the Automobile field?",
        "Is the Business or Domain of the autotrader development project in the Automobile field?",
        "Is the Business or Domain of this autotrader in the Automobile field?",
        "Is the Business or Domain of this autotrader project in the Automobile field?",
        "Is the Business or Domain of this autotrader development project in the Automobile field?",
        "Is the Business or Domain of the autotrader in the Automobile industry?",
        "Is the Business or Domain of the autotrader project in the Automobile industry?",
        "Is the Business or Domain of the autotrader development project in the Automobile industry?",
        "Is the Business or Domain of this autotrader in the Automobile industry?",
        "Is the Business or Domain of this autotrader project in the Automobile industry?",
        "Is the Business or Domain of this autotrader development project in the Automobile industry?",
        "Does the Business or Domain of the autotrader belong to the Automobile area?",
        "Does the Business or Domain of the autotrader project belong to the Automobile area?",
        "Does the Business or Domain of the autotrader development project belong to the Automobile area?",
        "Does the Business or Domain of this autotrader belong to the Automobile?",
        "Does the Business or Domain of this autotrader project belong to the Automobile?",
        "Does the Business or Domain of this autotrader development project belong to the Automobile?",
        "Does the Business or Domain of the autotrader belong to the Automobile area?",
        "Does the Business or Domain of the autotrader project belong to the Automobile area?",
        "Does the Business or Domain of the autotrader development project belong to the Automobile area?",
        "Does the Business or Domain of this autotrader belong to the Automobile area?",
        "Does the Business or Domain of this autotrader project belong to the Automobile area?",
        "Does the Business or Domain of this autotrader development project belong to the Automobile area?",
        "Does the Business or Domain of the autotrader belong to the Automobile field?",
        "Does the Business or Domain of the autotrader project belong to the Automobile field?",
        "Does the Business or Domain of the autotrader development project belong to the Automobile field?",
        "Does the Business or Domain of this autotrader belong to the Automobile field?",
        "Does the Business or Domain of this autotrader project belong to the Automobile field?",
        "Does the Business or Domain of this autotrader development project belong to the Automobile field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the autotrader development project belong to Automobile.",
        "Its domain is about Automobile area.",
        "It provides Automobile industry.",
        "The company is classified in the Automobile industry?"
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotrader_site",
      "patterns": [
        "I want to know more information about autotrader?",
        "Show me autotrader's page?",
        "autotrader's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://www.autotrader.com/.",
        "Follow this link: https://www.autotrader.com/."
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotrader_start_date",
      "patterns": [
        "When was the contract between autotrader and KMS signed?",
        "How long has autotrader been our customer?",
        "What was the first date of autotrader?",
        "Is the started date of the autotrader in Jan 1, 2014?",
        "Was the autotrader started in Jan 1, 2014?",
        "The autotrader was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the autotrader started?",
        "Is the started date of the autotrader project in Jan 1, 2014?",
        "Was the autotrader project started in Jan 1, 2014?",
        "The autotrader project was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the autotrader project started?",
        "Is the started date of the autotrader development project in Jan 1, 2014?",
        "Was the autotrader development project started in Jan 1, 2014?",
        "The autotrader development project was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the autotrader development project started?",
        "when did the autotrader start?",
        "when did the autotrader begin?",
        "when did the autotrader commence?",
        "when did the autotrader initiate?",
        "when did the autotrader project start?",
        "when did the autotrader project begin?",
        "when did the autotrader project commence?",
        "when did the autotrader project initiate?",
        "when did the autotrader development project start?",
        "when did the autotrader development project begin?",
        "when did the autotrader development project commence?",
        "when did the autotrader development project initiate?",
        "when did this autotrader start?",
        "when did this autotrader begin?",
        "when did this autotrader commence?",
        "when did this autotrader initiate?",
        "when did this autotrader project start?",
        "when did this autotrader project begin?",
        "when did this autotrader project commence?",
        "when did this autotrader project initiate?",
        "when did this autotrader development project start?",
        "when did this autotrader development project begin?",
        "when did this autotrader development project commence?",
        "when did this autotrader development project initiate?",
        "what was the date the autotrader started?",
        "what was the date the autotrader begun?",
        "what was the date the autotrader commenced?",
        "what was the date the autotrader intiated?",
        "what was the date the autotrader project started?",
        "what was the date the autotrader project begun?",
        "what was the date the autotrader project commenced?",
        "what was the date the autotrader project intiated?",
        "what was the date the autotrader development project started?",
        "what was the date the autotrader development project begun?",
        "what was the date the autotrader development project commenced?",
        "what was the date the autotrader development project intiated?",
        "what was the date this autotrader project started?",
        "what was the date this autotrader project begun?",
        "what was the date this autotrader project commenced?",
        "what was the date this autotrader project intiated?",
        "what was the date this autotrader development project started?",
        "what was the date this autotrader development project begun?",
        "what was the date this autotrader development project commenced?",
        "what was the date this autotrader development project intiated?"
      ],
      "responses": [
        "Yes, The started date of autotrader development project is Jan 1, 2014.",
        "It was on Jan 1, 2014",
        "Since Jan 1, 2014"
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotrader_member",
      "patterns": [
        "Does autotrader have many people work for it?",
        "Tell me the size of autotrader team",
        "Are there 7 members in the autotrader?",
        "Are there 7 members in the autotrader project?",
        "Are there 7 members in the autotrader development project?",
        "Are there 7 members in this autotrader?",
        "Are there 7 members in this autotrader project?",
        "Are there 7 members in this autotrader development project?",
        "Are there 7 members in the autotrader?",
        "Are there 7 members in the autotrader project?",
        "Are there 7 members in the autotrader development project?",
        "Are there 7 members in this autotrader?",
        "Are there 7 members in this autotrader project?",
        "Are there 7 members in this autotrader development project?",
        "There are 7 members in the autotrader, are not there?",
        "There are 7 members in the autotrader project, are not there?",
        "There are 7 members in the autotrader development project, are not there?",
        "There are 7 members in this autotrader, are not there?",
        "There are 7 members in this autotrader project, are not there?",
        "There are 7 members in this autotrader development project, are not there?",
        "There are 7 members in the autotrader, aren't there?",
        "There are 7 members in the autotrader project, aren't there?",
        "There are 7 members in the autotrader development project, aren't there?",
        "There are 7 members in this autotrader, are not there?",
        "There are 7 members in this autotrader project, are not there?",
        "There are 7 members in this autotrader development project, are not there?",
        "How many people in the autotrader?",
        "How many people in the autotrader project?",
        "How many people in the autotrader development project?",
        "How many people in this autotrader?",
        "How many people in this autotrader project?",
        "How many people in this autotrader development project?",
        "How many members in the autotrader?",
        "How many members in the autotrader project?",
        "How many members in the autotrader development project?",
        "How many members in this autotrader?",
        "How many members in this autotrader project?",
        "How many members in this autotrader development project?",
        "How many persons in the autotrader?",
        "How many persons in the autotrader project?",
        "How many persons in the autotrader development project?",
        "How many persons in this autotrader?",
        "How many persons in this autotrader project?",
        "How many persons in this autotrader development project?",
        "How about team size of the autotrader?",
        "How about team size of the autotrader project?",
        "How about team size of the autotrader development project?",
        "How about team size of this autotrader?",
        "How about team size of this autotrader project?",
        "How about team size of this autotrader development project?",
        "How about team size in the autotrader?",
        "How about team size in the autotrader project?",
        "How about team size in the autotrader development project?",
        "How about team size in this autotrader?",
        "How about team size in this autotrader project?",
        "How about team size in this autotrader development project?",
        "How many people in the autotrader?",
        "How many people in the autotrader project?",
        "How many people in the autotrader development project?",
        "How many people in this autotrader?",
        "How many people in this autotrader project?",
        "How many people in this autotrader development project?",
        "How many members in the autotrader?",
        "How many members in the autotrader project?",
        "How many members in the autotrader development project?",
        "How many members in this autotrader?",
        "How many members in this autotrader project?",
        "How many members in this autotrader development project?",
        "How many persons in the autotrader?",
        "How many persons in the autotrader project?",
        "How many persons in the autotrader development project?",
        "How many persons in this autotrader?",
        "How many persons in this autotrader project?",
        "How many persons in this autotrader development project?",
        "How about team size of the autotrader?",
        "How about team size of the autotrader project?",
        "How about team size of the autotrader development project?",
        "How about team size of this autotrader?",
        "How about team size of this autotrader project?",
        "How about team size of this autotrader development project?",
        "How about team size in the autotrader?",
        "How about team size in the autotrader project?",
        "How about team size in the autotrader development project?",
        "How about team size in this autotrader?",
        "How about team size in this autotrader project?",
        "How about team size in this autotrader development project?"
      ],
      "responses": [
        "Yes, there are 7 members in the autotrader development project.",
        "It is a group of 7 members",
        "The team size is 7",
        "autotrader is currently working well with 7 people"
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotrader_location",
      "patterns": [
        "How about the location of the autotrader in TV office?",
        "How about the location of the autotrader project  in TV office?",
        "How about the location of the autotrader development project  in TV office?",
        "How about the location of this autotrader in TV office?",
        "How about the location of this autotrader project in TV office?",
        "How about the location of this autotrader development project in TV office?",
        "What is the location of autotrader?",
        "Where can I find autotrader?",
        "How to meet autotrader team?"
      ],
      "responses": [
        "You can find the autotrader working space at 5th floor - TV office",
        "Do you intend to ask about the autotrader's headquarters",
        "It's 3003 Summit Blvd NE #200, Atlanta, GA 30319, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 5th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 5."
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "autotraderFavoriteActivities",
      "patterns": [
        "What do autotrader team like to do?",
        "Which activities do autotrader enjoy together?",
        "Favorite stuffs autotrader do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "A member of Tuyet Tinh Cox (Cox Automotive Client) and AutoTrader is under the guardian of a friendly Autobot (Bumblebee)"
      ],
      "context_filter": "autotrader"
    },
    {
      "tag": "hotschedules",
      "patterns": [
        "What is the hotschedules?",
        "What is the hotschedules project?",
        "What is the hotschedules development project?",
        "What is this hotschedules?",
        "What is this hotschedules project?",
        "What is this hotschedules development project?",
        "What is the hotschedules in BU A+?",
        "What is the hotschedules project in BU A+?",
        "What is the hotschedules development project?",
        "What is this hotschedules in BU A+?",
        "What is this hotschedules project in BU A+?",
        "What is this hotschedules development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "hotschedules"
    },
    {
      "tag": "hotschedules_office",
      "patterns": [
        "What is the hotschedules customer address?",
        "What is the addresss of owner hotschedules customer?",
        "What is the addresss of hotschedules owner?"
      ],
      "responses": [
        "Yes, the hotschedules customer is a US customer. His address is: 6504 Bridge Point Pkwy Ste 425, Austin, TX 78730, USA"
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedules_domain",
      "patterns": [
        "Which industry does hotschedules work in?",
        "Which field is hotschedules about?",
        "Which industry does hotschedules work in?",
        "Which field is hotschedules about?",
        "hotschedules's business domain?",
        "What's the hotschedules's Business or Domain?",
        "What's the hotschedules project 's Business or Domain?",
        "What's the hotschedules development project 's Business or Domain?",
        "What's this hotschedules's Business or Domain?",
        "What's this hotschedules project 's Business or Domain?",
        "What's this hotschedules development project 's Business or Domain?",
        "What is the hotschedules's Business or Domain?",
        "What is the hotschedules project 's Business or Domain?",
        "What is the hotschedules development project 's Business or Domain?",
        "What is this hotschedules's Business or Domain?",
        "What is this hotschedules project 's Business or Domain?",
        "What is this hotschedules development project 's Business or Domain?",
        "What's the hotschedules Business or Domain?",
        "What's the hotschedules project Business or Domain?",
        "What's the hotschedules development project Business or Domain?",
        "What is this hotschedules Business or Domain?",
        "What is this hotschedules project Business or Domain?",
        "What is this hotschedules development project Business or Domain?",
        "What is the Business or Domain of the hotschedules?",
        "What is the Business or Domain of the hotschedules project?",
        "What is the Business or Domain of the hotschedules development project?",
        "What is the Business or Domain of this hotschedules?",
        "What is the Business or Domain of this hotschedules project?",
        "What is the Business or Domain of this hotschedules development project?",
        "The Business or Domain of the hotschedules belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of the hotschedules project belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of the hotschedules development project belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of this hotschedules belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of this hotschedules project belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of this hotschedules development project belongs to the Hospitality Management area, doesn't it?",
        "The Business or Domain of the hotschedules belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of the hotschedules project belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of the hotschedules development project belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of this hotschedules belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of this hotschedules project belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of this hotschedules development project belongs to the Hospitality Management field, doesn't it?",
        "The Business or Domain of the hotschedules belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of the hotschedules project belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of the hotschedules development project belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of this hotschedules belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of this hotschedules project belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of this hotschedules development project belongs to the Hospitality Management industry, doesn't it?",
        "The Business or Domain of the hotschedules is in the Hospitality Management area, isn't it?",
        "The Business or Domain of the hotschedules project is in the Hospitality Management area, isn't it?",
        "The Business or Domain of the hotschedules development project is in the Hospitality Management area, isn't it?",
        "The Business or Domain of this hotschedules is in the Hospitality Management area, isn't it?",
        "The Business or Domain of this hotschedules project is in the Hospitality Management area, isn't it?",
        "The Business or Domain of this hotschedules development project is in the Hospitality Management area, isn't it?",
        "The Business or Domain of the hotschedules is in the Hospitality Management field, isn't it?",
        "The Business or Domain of the hotschedules project is in the Hospitality Management field, isn't it?",
        "The Business or Domain of the hotschedules development project is in the Hospitality Management field, isn't it?",
        "The Business or Domain of this hotschedules is in the Hospitality Management field, isn't it?",
        "The Business or Domain of this hotschedules project is in the Hospitality Management field, isn't it?",
        "The Business or Domain of this hotschedules development project is in the Hospitality Management field, isn't it?",
        "The Business or Domain of the hotschedules is in the Hospitality Management industry, isn't it?",
        "The Business or Domain of the hotschedules project is in the Hospitality Management industry, isn't it?",
        "The Business or Domain of the hotschedules development project is in the Hospitality Management industry, isn't it?",
        "The Business or Domain of this hotschedules is in the Hospitality Management industry, isn't it?",
        "The Business or Domain of this hotschedules project is in the Hospitality Management industry, isn't it?",
        "The Business or Domain of this hotschedules development project is in the Hospitality Management industry, isn't it?",
        "Is the Business or Domain of the hotschedules in the Hospitality Management area?",
        "Is the Business or Domain of the hotschedules project in the Hospitality Management area?",
        "Is the Business or Domain of the hotschedules development project in the Hospitality Management area?",
        "Is the Business or Domain of this hotschedules in the Hospitality Management area?",
        "Is the Business or Domain of this hotschedules project in the Hospitality Management area?",
        "Is the Business or Domain of this hotschedules development project in the Hospitality Management area?",
        "Is the Business or Domain of the hotschedules in the Hospitality Management field?",
        "Is the Business or Domain of the hotschedules project in the Hospitality Management field?",
        "Is the Business or Domain of the hotschedules development project in the Hospitality Management field?",
        "Is the Business or Domain of this hotschedules in the Hospitality Management field?",
        "Is the Business or Domain of this hotschedules project in the Hospitality Management field?",
        "Is the Business or Domain of this hotschedules development project in the Hospitality Management field?",
        "Is the Business or Domain of the hotschedules in the Hospitality Management industry?",
        "Is the Business or Domain of the hotschedules project in the Hospitality Management industry?",
        "Is the Business or Domain of the hotschedules development project in the Hospitality Management industry?",
        "Is the Business or Domain of this hotschedules in the Hospitality Management industry?",
        "Is the Business or Domain of this hotschedules project in the Hospitality Management industry?",
        "Is the Business or Domain of this hotschedules development project in the Hospitality Management industry?",
        "Does the Business or Domain of the hotschedules belong to the Hospitality Management area?",
        "Does the Business or Domain of the hotschedules project belong to the Hospitality Management area?",
        "Does the Business or Domain of the hotschedules development project belong to the Hospitality Management area?",
        "Does the Business or Domain of this hotschedules belong to the Hospitality Management?",
        "Does the Business or Domain of this hotschedules project belong to the Hospitality Management?",
        "Does the Business or Domain of this hotschedules development project belong to the Hospitality Management?",
        "Does the Business or Domain of the hotschedules belong to the Hospitality Management area?",
        "Does the Business or Domain of the hotschedules project belong to the Hospitality Management area?",
        "Does the Business or Domain of the hotschedules development project belong to the Hospitality Management area?",
        "Does the Business or Domain of this hotschedules belong to the Hospitality Management area?",
        "Does the Business or Domain of this hotschedules project belong to the Hospitality Management area?",
        "Does the Business or Domain of this hotschedules development project belong to the Hospitality Management area?",
        "Does the Business or Domain of the hotschedules belong to the Hospitality Management field?",
        "Does the Business or Domain of the hotschedules project belong to the Hospitality Management field?",
        "Does the Business or Domain of the hotschedules development project belong to the Hospitality Management field?",
        "Does the Business or Domain of this hotschedules belong to the Hospitality Management field?",
        "Does the Business or Domain of this hotschedules project belong to the Hospitality Management field?",
        "Does the Business or Domain of this hotschedules development project belong to the Hospitality Management field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the hotschedules development project belong to Hospitality Management.",
        "Its domain is about Hospitality Management area.",
        "It provides Hospitality Management industry.",
        "The company is classified in the Hospitality Management industry?"
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedules_site",
      "patterns": [
        "I want to know more information about hotschedules?",
        "Show me hotschedules's page?",
        "hotschedules's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://www.hotschedules.com/.",
        "Follow this link: https://www.hotschedules.com/."
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedules_start_date",
      "patterns": [
        "When was the contract between hotschedules and KMS ended?",
        "When was the contract between hotschedules and KMS signed?",
        "How long has hotschedules been our customer?",
        "What was the first date of hotschedules?",
        "Is the started date of the hotschedules in May 1, 2017?",
        "Was the hotschedules started in May 1, 2017?",
        "The hotschedules was started in May 1, 2017, wasn't it?",
        "In May 1, 2017, was the hotschedules started?",
        "Is the started date of the hotschedules project in May 1, 2017?",
        "Was the hotschedules project started in May 1, 2017?",
        "The hotschedules project was started in May 1, 2017, wasn't it?",
        "In May 1, 2017, was the hotschedules project started?",
        "Is the started date of the hotschedules development project in May 1, 2017?",
        "Was the hotschedules development project started in May 1, 2017?",
        "The hotschedules development project was started in May 1, 2017, wasn't it?",
        "In May 1, 2017, was the hotschedules development project started?",
        "In Sep 20, 2019, was the hotschedules development project ended?",
        "when did the hotschedules start?",
        "when did the hotschedules begin?",
        "when did the hotschedules commence?",
        "when did the hotschedules initiate?",
        "when did the hotschedules project start?",
        "when did the hotschedules project begin?",
        "when did the hotschedules project commence?",
        "when did the hotschedules project initiate?",
        "when did the hotschedules development project start?",
        "when did the hotschedules development project begin?",
        "when did the hotschedules development project commence?",
        "when did the hotschedules development project initiate?",
        "when did this hotschedules start?",
        "when did this hotschedules begin?",
        "when did this hotschedules commence?",
        "when did this hotschedules initiate?",
        "when did this hotschedules project start?",
        "when did this hotschedules project begin?",
        "when did this hotschedules project commence?",
        "when did this hotschedules project initiate?",
        "when did this hotschedules development project start?",
        "when did this hotschedules development project begin?",
        "when did this hotschedules development project commence?",
        "when did this hotschedules development project initiate?",
        "what was the date the hotschedules started?",
        "what was the date the hotschedules begun?",
        "what was the date the hotschedules commenced?",
        "what was the date the hotschedules intiated?",
        "what was the date the hotschedules project started?",
        "what was the date the hotschedules project begun?",
        "what was the date the hotschedules project commenced?",
        "what was the date the hotschedules project intiated?",
        "what was the date the hotschedules development project started?",
        "what was the date the hotschedules development project begun?",
        "what was the date the hotschedules development project commenced?",
        "what was the date the hotschedules development project intiated?",
        "what was the date this hotschedules project started?",
        "what was the date this hotschedules project begun?",
        "what was the date this hotschedules project commenced?",
        "what was the date this hotschedules project intiated?",
        "what was the date this hotschedules development project started?",
        "what was the date this hotschedules development project begun?",
        "what was the date this hotschedules development project commenced?",
        "what was the date this hotschedules development project intiated?"
      ],
      "responses": [
        "Yes, The started date of hotschedules development project is May 1, 2017 and ended in Sep 20, 2019.",
        "It was on May 1, 2017 and ended in Sep 20, 2019",
        "Since May 1, 2017 and ended in Sep 20, 2019"
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedules_member",
      "patterns": [
        "Does hotschedules have many people work for it?",
        "Tell me the size of hotschedules team",
        "Are there 37 members in the hotschedules?",
        "Are there 37 members in the hotschedules project?",
        "Are there 37 members in the hotschedules development project?",
        "Are there 37 members in this hotschedules?",
        "Are there 37 members in this hotschedules project?",
        "Are there 37 members in this hotschedules development project?",
        "Are there 37 members in the hotschedules?",
        "Are there 37 members in the hotschedules project?",
        "Are there 37 members in the hotschedules development project?",
        "Are there 37 members in this hotschedules?",
        "Are there 37 members in this hotschedules project?",
        "Are there 37 members in this hotschedules development project?",
        "There are 37 members in the hotschedules, are not there?",
        "There are 37 members in the hotschedules project, are not there?",
        "There are 37 members in the hotschedules development project, are not there?",
        "There are 37 members in this hotschedules, are not there?",
        "There are 37 members in this hotschedules project, are not there?",
        "There are 37 members in this hotschedules development project, are not there?",
        "There are 37 members in the hotschedules, aren't there?",
        "There are 37 members in the hotschedules project, aren't there?",
        "There are 37 members in the hotschedules development project, aren't there?",
        "There are 37 members in this hotschedules, are not there?",
        "There are 37 members in this hotschedules project, are not there?",
        "There are 37 members in this hotschedules development project, are not there?",
        "How many people in the hotschedules?",
        "How many people in the hotschedules project?",
        "How many people in the hotschedules development project?",
        "How many people in this hotschedules?",
        "How many people in this hotschedules project?",
        "How many people in this hotschedules development project?",
        "How many members in the hotschedules?",
        "How many members in the hotschedules project?",
        "How many members in the hotschedules development project?",
        "How many members in this hotschedules?",
        "How many members in this hotschedules project?",
        "How many members in this hotschedules development project?",
        "How many persons in the hotschedules?",
        "How many persons in the hotschedules project?",
        "How many persons in the hotschedules development project?",
        "How many persons in this hotschedules?",
        "How many persons in this hotschedules project?",
        "How many persons in this hotschedules development project?",
        "How about team size of the hotschedules?",
        "How about team size of the hotschedules project?",
        "How about team size of the hotschedules development project?",
        "How about team size of this hotschedules?",
        "How about team size of this hotschedules project?",
        "How about team size of this hotschedules development project?",
        "How about team size in the hotschedules?",
        "How about team size in the hotschedules project?",
        "How about team size in the hotschedules development project?",
        "How about team size in this hotschedules?",
        "How about team size in this hotschedules project?",
        "How about team size in this hotschedules development project?",
        "How many people in the hotschedules?",
        "How many people in the hotschedules project?",
        "How many people in the hotschedules development project?",
        "How many people in this hotschedules?",
        "How many people in this hotschedules project?",
        "How many people in this hotschedules development project?",
        "How many members in the hotschedules?",
        "How many members in the hotschedules project?",
        "How many members in the hotschedules development project?",
        "How many members in this hotschedules?",
        "How many members in this hotschedules project?",
        "How many members in this hotschedules development project?",
        "How many persons in the hotschedules?",
        "How many persons in the hotschedules project?",
        "How many persons in the hotschedules development project?",
        "How many persons in this hotschedules?",
        "How many persons in this hotschedules project?",
        "How many persons in this hotschedules development project?",
        "How about team size of the hotschedules?",
        "How about team size of the hotschedules project?",
        "How about team size of the hotschedules development project?",
        "How about team size of this hotschedules?",
        "How about team size of this hotschedules project?",
        "How about team size of this hotschedules development project?",
        "How about team size in the hotschedules?",
        "How about team size in the hotschedules project?",
        "How about team size in the hotschedules development project?",
        "How about team size in this hotschedules?",
        "How about team size in this hotschedules project?",
        "How about team size in this hotschedules development project?"
      ],
      "responses": [
        "Yes, there are 37 members in the hotschedules development project.",
        "It is a group of 37 members",
        "The team size is 37",
        "hotschedules is currently working well with 37 people"
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedules_location",
      "patterns": [
        "How about the location of the hotschedules in TV office?",
        "How about the location of the hotschedules project  in TV office?",
        "How about the location of the hotschedules development project  in TV office?",
        "How about the location of this hotschedules in TV office?",
        "How about the location of this hotschedules project in TV office?",
        "How about the location of this hotschedules development project in TV office?",
        "What is the location of hotschedules?",
        "Where can I find hotschedules?",
        "How to meet hotschedules team?"
      ],
      "responses": [
        "You can find the hotschedules working space at 4th floor - TV office",
        "Do you intend to ask about the hotschedules's headquarters",
        "It's 6504 Bridge Point Pkwy Ste 425, Austin, TX 78730, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "hotschedulesFavoriteActivities",
      "patterns": [
        "What do hotschedules team like to do?",
        "Which activities do hotschedules enjoy together?",
        "Favorite stuffs hotschedules do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "The biggest project in KMS (140 members at peak time) and We have internal CEO team which means Chief Entertainment Officers."
      ],
      "context_filter": "hotschedules"
    },
    {
      "tag": "kbb",
      "patterns": [
        "What is the kbb?",
        "What is the kbb project?",
        "What is the kbb development project?",
        "What is this kbb?",
        "What is this kbb project?",
        "What is this kbb development project?",
        "What is the kbb in BU A+?",
        "What is the kbb project in BU A+?",
        "What is the kbb development project?",
        "What is this kbb in BU A+?",
        "What is this kbb project in BU A+?",
        "What is this kbb development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "kbb"
    },
    {
      "tag": "kbb_office",
      "patterns": [
        "What is the kbb customer address?",
        "What is the addresss of owner kbb customer?",
        "What is the addresss of kbb owner?"
      ],
      "responses": [
        "Yes, the kbb customer is a US customer. His address is: 195 Technology Dr, Irvine, CA 92618, USA"
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbb_domain",
      "patterns": [
        "Which industry does kbb work in?",
        "Which field is kbb about?",
        "Which industry does kbb work in?",
        "Which field is kbb about?",
        "kbb's business domain?",
        "What's the kbb's Business or Domain?",
        "What's the kbb project 's Business or Domain?",
        "What's the kbb development project 's Business or Domain?",
        "What's this kbb's Business or Domain?",
        "What's this kbb project 's Business or Domain?",
        "What's this kbb development project 's Business or Domain?",
        "What is the kbb's Business or Domain?",
        "What is the kbb project 's Business or Domain?",
        "What is the kbb development project 's Business or Domain?",
        "What is this kbb's Business or Domain?",
        "What is this kbb project 's Business or Domain?",
        "What is this kbb development project 's Business or Domain?",
        "What's the kbb Business or Domain?",
        "What's the kbb project Business or Domain?",
        "What's the kbb development project Business or Domain?",
        "What is this kbb Business or Domain?",
        "What is this kbb project Business or Domain?",
        "What is this kbb development project Business or Domain?",
        "What is the Business or Domain of the kbb?",
        "What is the Business or Domain of the kbb project?",
        "What is the Business or Domain of the kbb development project?",
        "What is the Business or Domain of this kbb?",
        "What is the Business or Domain of this kbb project?",
        "What is the Business or Domain of this kbb development project?",
        "The Business or Domain of the kbb belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the kbb project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the kbb development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this kbb belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this kbb project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of this kbb development project belongs to the Automobile area, doesn't it?",
        "The Business or Domain of the kbb belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the kbb project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the kbb development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this kbb belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this kbb project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of this kbb development project belongs to the Automobile field, doesn't it?",
        "The Business or Domain of the kbb belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the kbb project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the kbb development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this kbb belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this kbb project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of this kbb development project belongs to the Automobile industry, doesn't it?",
        "The Business or Domain of the kbb is in the Automobile area, isn't it?",
        "The Business or Domain of the kbb project is in the Automobile area, isn't it?",
        "The Business or Domain of the kbb development project is in the Automobile area, isn't it?",
        "The Business or Domain of this kbb is in the Automobile area, isn't it?",
        "The Business or Domain of this kbb project is in the Automobile area, isn't it?",
        "The Business or Domain of this kbb development project is in the Automobile area, isn't it?",
        "The Business or Domain of the kbb is in the Automobile field, isn't it?",
        "The Business or Domain of the kbb project is in the Automobile field, isn't it?",
        "The Business or Domain of the kbb development project is in the Automobile field, isn't it?",
        "The Business or Domain of this kbb is in the Automobile field, isn't it?",
        "The Business or Domain of this kbb project is in the Automobile field, isn't it?",
        "The Business or Domain of this kbb development project is in the Automobile field, isn't it?",
        "The Business or Domain of the kbb is in the Automobile industry, isn't it?",
        "The Business or Domain of the kbb project is in the Automobile industry, isn't it?",
        "The Business or Domain of the kbb development project is in the Automobile industry, isn't it?",
        "The Business or Domain of this kbb is in the Automobile industry, isn't it?",
        "The Business or Domain of this kbb project is in the Automobile industry, isn't it?",
        "The Business or Domain of this kbb development project is in the Automobile industry, isn't it?",
        "Is the Business or Domain of the kbb in the Automobile area?",
        "Is the Business or Domain of the kbb project in the Automobile area?",
        "Is the Business or Domain of the kbb development project in the Automobile area?",
        "Is the Business or Domain of this kbb in the Automobile area?",
        "Is the Business or Domain of this kbb project in the Automobile area?",
        "Is the Business or Domain of this kbb development project in the Automobile area?",
        "Is the Business or Domain of the kbb in the Automobile field?",
        "Is the Business or Domain of the kbb project in the Automobile field?",
        "Is the Business or Domain of the kbb development project in the Automobile field?",
        "Is the Business or Domain of this kbb in the Automobile field?",
        "Is the Business or Domain of this kbb project in the Automobile field?",
        "Is the Business or Domain of this kbb development project in the Automobile field?",
        "Is the Business or Domain of the kbb in the Automobile industry?",
        "Is the Business or Domain of the kbb project in the Automobile industry?",
        "Is the Business or Domain of the kbb development project in the Automobile industry?",
        "Is the Business or Domain of this kbb in the Automobile industry?",
        "Is the Business or Domain of this kbb project in the Automobile industry?",
        "Is the Business or Domain of this kbb development project in the Automobile industry?",
        "Does the Business or Domain of the kbb belong to the Automobile area?",
        "Does the Business or Domain of the kbb project belong to the Automobile area?",
        "Does the Business or Domain of the kbb development project belong to the Automobile area?",
        "Does the Business or Domain of this kbb belong to the Automobile?",
        "Does the Business or Domain of this kbb project belong to the Automobile?",
        "Does the Business or Domain of this kbb development project belong to the Automobile?",
        "Does the Business or Domain of the kbb belong to the Automobile area?",
        "Does the Business or Domain of the kbb project belong to the Automobile area?",
        "Does the Business or Domain of the kbb development project belong to the Automobile area?",
        "Does the Business or Domain of this kbb belong to the Automobile area?",
        "Does the Business or Domain of this kbb project belong to the Automobile area?",
        "Does the Business or Domain of this kbb development project belong to the Automobile area?",
        "Does the Business or Domain of the kbb belong to the Automobile field?",
        "Does the Business or Domain of the kbb project belong to the Automobile field?",
        "Does the Business or Domain of the kbb development project belong to the Automobile field?",
        "Does the Business or Domain of this kbb belong to the Automobile field?",
        "Does the Business or Domain of this kbb project belong to the Automobile field?",
        "Does the Business or Domain of this kbb development project belong to the Automobile field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the kbb development project belong to Automobile.",
        "Its domain is about Automobile area.",
        "It provides Automobile industry.",
        "The company is classified in the Automobile industry?"
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbb_site",
      "patterns": [
        "I want to know more information about kbb?",
        "Show me kbb's page?",
        "kbb's business site?"
      ],
      "responses": [
        "It's easy. You can find anything you want here: https://www.kbb.com/.",
        "Follow this link: https://www.kbb.com/."
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbb_start_date",
      "patterns": [
        "When was the contract between kbb and KMS signed?",
        "How long has kbb been our customer?",
        "What was the first date of kbb?",
        "Is the started date of the kbb in Jan 1, 2014?",
        "Was the kbb started in Jan 1, 2014?",
        "The kbb was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the kbb started?",
        "Is the started date of the kbb project in Jan 1, 2014?",
        "Was the kbb project started in Jan 1, 2014?",
        "The kbb project was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the kbb project started?",
        "Is the started date of the kbb development project in Jan 1, 2014?",
        "Was the kbb development project started in Jan 1, 2014?",
        "The kbb development project was started in Jan 1, 2014, wasn't it?",
        "In Jan 1, 2014, was the kbb development project started?",
        "when did the kbb start?",
        "when did the kbb begin?",
        "when did the kbb commence?",
        "when did the kbb initiate?",
        "when did the kbb project start?",
        "when did the kbb project begin?",
        "when did the kbb project commence?",
        "when did the kbb project initiate?",
        "when did the kbb development project start?",
        "when did the kbb development project begin?",
        "when did the kbb development project commence?",
        "when did the kbb development project initiate?",
        "when did this kbb start?",
        "when did this kbb begin?",
        "when did this kbb commence?",
        "when did this kbb initiate?",
        "when did this kbb project start?",
        "when did this kbb project begin?",
        "when did this kbb project commence?",
        "when did this kbb project initiate?",
        "when did this kbb development project start?",
        "when did this kbb development project begin?",
        "when did this kbb development project commence?",
        "when did this kbb development project initiate?",
        "what was the date the kbb started?",
        "what was the date the kbb begun?",
        "what was the date the kbb commenced?",
        "what was the date the kbb intiated?",
        "what was the date the kbb project started?",
        "what was the date the kbb project begun?",
        "what was the date the kbb project commenced?",
        "what was the date the kbb project intiated?",
        "what was the date the kbb development project started?",
        "what was the date the kbb development project begun?",
        "what was the date the kbb development project commenced?",
        "what was the date the kbb development project intiated?",
        "what was the date this kbb project started?",
        "what was the date this kbb project begun?",
        "what was the date this kbb project commenced?",
        "what was the date this kbb project intiated?",
        "what was the date this kbb development project started?",
        "what was the date this kbb development project begun?",
        "what was the date this kbb development project commenced?",
        "what was the date this kbb development project intiated?"
      ],
      "responses": [
        "Yes, The started date of kbb development project is Jan 1, 2014.",
        "It was on Jan 1, 2014.",
        "Since Jan 1, 2014"
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbb_member",
      "patterns": [
        "Does kbb have many people work for it?",
        "Tell me the size of kbb team",
        "Are there 45 members in the kbb?",
        "Are there 45 members in the kbb project?",
        "Are there 45 members in the kbb development project?",
        "Are there 45 members in this kbb?",
        "Are there 45 members in this kbb project?",
        "Are there 45 members in this kbb development project?",
        "Are there 45 members in the kbb?",
        "Are there 45 members in the kbb project?",
        "Are there 45 members in the kbb development project?",
        "Are there 45 members in this kbb?",
        "Are there 45 members in this kbb project?",
        "Are there 45 members in this kbb development project?",
        "There are 45 members in the kbb, are not there?",
        "There are 45 members in the kbb project, are not there?",
        "There are 45 members in the kbb development project, are not there?",
        "There are 45 members in this kbb, are not there?",
        "There are 45 members in this kbb project, are not there?",
        "There are 45 members in this kbb development project, are not there?",
        "There are 45 members in the kbb, aren't there?",
        "There are 45 members in the kbb project, aren't there?",
        "There are 45 members in the kbb development project, aren't there?",
        "There are 45 members in this kbb, are not there?",
        "There are 45 members in this kbb project, are not there?",
        "There are 45 members in this kbb development project, are not there?",
        "How many people in the kbb?",
        "How many people in the kbb project?",
        "How many people in the kbb development project?",
        "How many people in this kbb?",
        "How many people in this kbb project?",
        "How many people in this kbb development project?",
        "How many members in the kbb?",
        "How many members in the kbb project?",
        "How many members in the kbb development project?",
        "How many members in this kbb?",
        "How many members in this kbb project?",
        "How many members in this kbb development project?",
        "How many persons in the kbb?",
        "How many persons in the kbb project?",
        "How many persons in the kbb development project?",
        "How many persons in this kbb?",
        "How many persons in this kbb project?",
        "How many persons in this kbb development project?",
        "How about team size of the kbb?",
        "How about team size of the kbb project?",
        "How about team size of the kbb development project?",
        "How about team size of this kbb?",
        "How about team size of this kbb project?",
        "How about team size of this kbb development project?",
        "How about team size in the kbb?",
        "How about team size in the kbb project?",
        "How about team size in the kbb development project?",
        "How about team size in this kbb?",
        "How about team size in this kbb project?",
        "How about team size in this kbb development project?",
        "How many people in the kbb?",
        "How many people in the kbb project?",
        "How many people in the kbb development project?",
        "How many people in this kbb?",
        "How many people in this kbb project?",
        "How many people in this kbb development project?",
        "How many members in the kbb?",
        "How many members in the kbb project?",
        "How many members in the kbb development project?",
        "How many members in this kbb?",
        "How many members in this kbb project?",
        "How many members in this kbb development project?",
        "How many persons in the kbb?",
        "How many persons in the kbb project?",
        "How many persons in the kbb development project?",
        "How many persons in this kbb?",
        "How many persons in this kbb project?",
        "How many persons in this kbb development project?",
        "How about team size of the kbb?",
        "How about team size of the kbb project?",
        "How about team size of the kbb development project?",
        "How about team size of this kbb?",
        "How about team size of this kbb project?",
        "How about team size of this kbb development project?",
        "How about team size in the kbb?",
        "How about team size in the kbb project?",
        "How about team size in the kbb development project?",
        "How about team size in this kbb?",
        "How about team size in this kbb project?",
        "How about team size in this kbb development project?"
      ],
      "responses": [
        "Yes, there are 45 members in the kbb development project.",
        "It is a group of 45 members",
        "The team size is 45.",
        "kbb is currently working well with 45 people"
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbb_location",
      "patterns": [
        "How about the location of the kbb in TV office?",
        "How about the location of the kbb project  in TV office?",
        "How about the location of the kbb development project  in TV office?",
        "How about the location of this kbb in TV office?",
        "How about the location of this kbb project in TV office?",
        "How about the location of this kbb development project in TV office?",
        "What is the location of kbb?",
        "Where can I find kbb?",
        "How to meet kbb team?"
      ],
      "responses": [
        "You can find the kbb working space at 4th floor - TV office",
        "Do you intend to ask about the kbb's headquarters",
        "It's 195 Technology Dr, Irvine, CA 92618, USA. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 5th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 5."
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "kbbFavoriteActivities",
      "patterns": [
        "What do kbb team like to do?",
        "Which activities do kbb enjoy together?",
        "Favorite stuffs kbb do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "Learning - Sharing - Playing - Caring - Listening, master of Cars, but have no any car, ranked the first in the number of Gay Boys, eat, eat more, eat forever (Viva banh trang tron), young, strong & long fun, gym everyday with special care from Muscle Boys",
        "A member of Tuyet Tinh Cox (Cox Automotive Client), Stable COE audit rating of 4.3 and Nude Job (Nghiep Tran) is the face of every birth - month party ... except his."
      ],
      "context_filter": "kbb"
    },
    {
      "tag": "babysharks",
      "patterns": [
        "What is the babysharks?",
        "What is the babysharks project?",
        "What is the babysharks new project?",
        "What is this babysharks?",
        "What is this babysharks project?",
        "What is this babysharks new project?",
        "What is the babysharks in BU A+?",
        "What is the babysharks project in BU A+?",
        "What is the babysharks new project?",
        "What is this babysharks in BU A+?",
        "What is this babysharks project in BU A+?",
        "What is this babysharks new project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a new project (may be called: resource pool) in BU A+"
      ],
      "context_set": "babysharks"
    },
    {
      "tag": "babysharks_start_date",
      "patterns": [
        "When was the contract between babysharks and KMS signed?",
        "How long has babysharks been our customer?",
        "What was the first date of babysharks?",
        "Is the started date of the babysharks in August 2018?",
        "Was the babysharks started in August 2018?",
        "The babysharks was started in August 2018, wasn't it?",
        "In August 2018, was the babysharks started?",
        "Is the started date of the babysharks project in August 2018?",
        "Was the babysharks project started in August 2018?",
        "The babysharks project was started in August 2018, wasn't it?",
        "In August 2018, was the babysharks project started?",
        "Is the started date of the babysharks new project in August 2018?",
        "Was the babysharks new project started in August 2018?",
        "The babysharks new project was started in August 2018, wasn't it?",
        "In August 2018, was the babysharks new project started?",
        "when did the babysharks start?",
        "when did the babysharks begin?",
        "when did the babysharks commence?",
        "when did the babysharks initiate?",
        "when did the babysharks project start?",
        "when did the babysharks project begin?",
        "when did the babysharks project commence?",
        "when did the babysharks project initiate?",
        "when did the babysharks new project start?",
        "when did the babysharks new project begin?",
        "when did the babysharks new project commence?",
        "when did the babysharks new project initiate?",
        "when did this babysharks start?",
        "when did this babysharks begin?",
        "when did this babysharks commence?",
        "when did this babysharks initiate?",
        "when did this babysharks project start?",
        "when did this babysharks project begin?",
        "when did this babysharks project commence?",
        "when did this babysharks project initiate?",
        "when did this babysharks new project start?",
        "when did this babysharks new project begin?",
        "when did this babysharks new project commence?",
        "when did this babysharks new project initiate?",
        "what was the date the babysharks started?",
        "what was the date the babysharks begun?",
        "what was the date the babysharks commenced?",
        "what was the date the babysharks intiated?",
        "what was the date the babysharks project started?",
        "what was the date the babysharks project begun?",
        "what was the date the babysharks project commenced?",
        "what was the date the babysharks project intiated?",
        "what was the date the babysharks new project started?",
        "what was the date the babysharks new project begun?",
        "what was the date the babysharks new project commenced?",
        "what was the date the babysharks new project intiated?",
        "what was the date this babysharks project started?",
        "what was the date this babysharks project begun?",
        "what was the date this babysharks project commenced?",
        "what was the date this babysharks project intiated?",
        "what was the date this babysharks new project started?",
        "what was the date this babysharks new project begun?",
        "what was the date this babysharks new project commenced?",
        "what was the date this babysharks new project intiated?"
      ],
      "responses": [
        "Yes, The started date of babysharks new project is August 2018.",
        "It was on August 2018.",
        "Since August 2018"
      ],
      "context_filter": "babysharks"
    },
    {
      "tag": "babysharks_member",
      "patterns": [
        "Does babysharks have many people work for it?",
        "Tell me the size of babysharks team",
        "Are there members (under ramming-up and ramming-down) in the babysharks?",
        "Are there members (under ramming-up and ramming-down) in the babysharks project?",
        "Are there members (under ramming-up and ramming-down) in the babysharks new project?",
        "Are there members (under ramming-up and ramming-down) in this babysharks?",
        "Are there members (under ramming-up and ramming-down) in this babysharks project?",
        "Are there members (under ramming-up and ramming-down) in this babysharks new project?",
        "Are there members (under ramming-up and ramming-down) in the babysharks?",
        "Are there members (under ramming-up and ramming-down) in the babysharks project?",
        "Are there members (under ramming-up and ramming-down) in the babysharks new project?",
        "Are there members (under ramming-up and ramming-down) in this babysharks?",
        "Are there members (under ramming-up and ramming-down) in this babysharks project?",
        "Are there members (under ramming-up and ramming-down) in this babysharks new project?",
        "There are members (under ramming-up and ramming-down) in the babysharks, are not there?",
        "There are members (under ramming-up and ramming-down) in the babysharks project, are not there?",
        "There are members (under ramming-up and ramming-down) in the babysharks new project, are not there?",
        "There are members in this babysharks, are not there?",
        "There are members (under ramming-up and ramming-down) in this babysharks project, are not there?",
        "There are members (under ramming-up and ramming-down) in this babysharks new project, are not there?",
        "There are members (under ramming-up and ramming-down) in the babysharks, aren't there?",
        "There are members (under ramming-up and ramming-down) in the babysharks project, aren't there?",
        "There are members (under ramming-up and ramming-down) in the babysharks new project, aren't there?",
        "There are members (under ramming-up and ramming-down) in this babysharks, are not there?",
        "There are members (under ramming-up and ramming-down) in this babysharks project, are not there?",
        "There are members (under ramming-up and ramming-down) in this babysharks new project, are not there?",
        "How many people in the babysharks?",
        "How many people in the babysharks project?",
        "How many people in the babysharks new project?",
        "How many people in this babysharks?",
        "How many people in this babysharks project?",
        "How many people in this babysharks new project?",
        "How many members in the babysharks?",
        "How many members in the babysharks project?",
        "How many members in the babysharks new project?",
        "How many members in this babysharks?",
        "How many members in this babysharks project?",
        "How many members in this babysharks new project?",
        "How many persons in the babysharks?",
        "How many persons in the babysharks project?",
        "How many persons in the babysharks new project?",
        "How many persons in this babysharks?",
        "How many persons in this babysharks project?",
        "How many persons in this babysharks new project?",
        "How about team size of the babysharks?",
        "How about team size of the babysharks project?",
        "How about team size of the babysharks new project?",
        "How about team size of this babysharks?",
        "How about team size of this babysharks project?",
        "How about team size of this babysharks new project?",
        "How about team size in the babysharks?",
        "How about team size in the babysharks project?",
        "How about team size in the babysharks new project?",
        "How about team size in this babysharks?",
        "How about team size in this babysharks project?",
        "How about team size in this babysharks new project?",
        "How many people in the babysharks?",
        "How many people in the babysharks project?",
        "How many people in the babysharks new project?",
        "How many people in this babysharks?",
        "How many people in this babysharks project?",
        "How many people in this babysharks new project?",
        "How many members in the babysharks?",
        "How many members in the babysharks project?",
        "How many members in the babysharks new project?",
        "How many members in this babysharks?",
        "How many members in this babysharks project?",
        "How many members in this babysharks new project?",
        "How many persons in the babysharks?",
        "How many persons in the babysharks project?",
        "How many persons in the babysharks new project?",
        "How many persons in this babysharks?",
        "How many persons in this babysharks project?",
        "How many persons in this babysharks new project?",
        "How about team size of the babysharks?",
        "How about team size of the babysharks project?",
        "How about team size of the babysharks new project?",
        "How about team size of this babysharks?",
        "How about team size of this babysharks project?",
        "How about team size of this babysharks new project?",
        "How about team size in the babysharks?",
        "How about team size in the babysharks project?",
        "How about team size in the babysharks new project?",
        "How about team size in this babysharks?",
        "How about team size in this babysharks project?",
        "How about team size in this babysharks new project?"
      ],
      "responses": [
        "Yes, there are members (under ramming-up and ramming-down) in the babysharks new project.",
        "It is a group of members (under ramming-up and ramming-down) ",
        "The team size is un-identified (under ramming-up and ramming-down)."
      ],
      "context_filter": "babysharks"
    },
    {
      "tag": "babysharks_location",
      "patterns": [
        "How about the location of the babysharks in TV office?",
        "How about the location of the babysharks project  in TV office?",
        "How about the location of the babysharks new project  in TV office?",
        "How about the location of this babysharks in TV office?",
        "How about the location of this babysharks project in TV office?",
        "How about the location of this babysharks new project in TV office?",
        "What is the location of babysharks?",
        "Where can I find babysharks?",
        "How to meet babysharks team?"
      ],
      "responses": [
        "You can find the babysharks working space at 4th floor - TV office",
        "Do you intend to ask about the babysharks's headquarters",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "babysharks"
    },
    {
      "tag": "babysharksFavoriteActivities",
      "patterns": [
        "What do babysharks team like to do?",
        "Which activities do babysharks enjoy together?",
        "Favorite stuffs babysharks do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "They usually learn, learn more, learn forever."
      ],
      "context_filter": "babysharks"
    },
    {
      "tag": "cloudhms",
      "patterns": [
        "What is the cloudhms?",
        "What is the cloudhms project?",
        "What is the cloudhms development project?",
        "What is this cloudhms?",
        "What is this cloudhms project?",
        "What is this cloudhms development project?",
        "What is the cloudhms in BU A+?",
        "What is the cloudhms project in BU A+?",
        "What is the cloudhms development project?",
        "What is this cloudhms in BU A+?",
        "What is this cloudhms project in BU A+?",
        "What is this cloudhms development project in BU A+?"
      ],
      "responses": [
        "Yes, It is the  name of a development project in BU A+",
        "Yes, this is one of development projects in BU A+"
      ],
      "context_set": "cloudhms"
    },
    {
      "tag": "cloudhms_office",
      "patterns": [
        "What is the cloudhms customer address?",
        "What is the addresss of owner cloudhms customer?",
        "What is the addresss of cloudhms owner?"
      ],
      "responses": [
        "Yes, the cloudhms customer is a VietNam customer. His address is: ETOWN Central, Floor 24th, 11 Doan Van Bo, District 4, HCMC"
      ],
      "context_filter": "cloudhms"
    },
    {
      "tag": "cloudhms_domain",
      "patterns": [
        "Which industry does cloudhms work in?",
        "Which field is cloudhms about?",
        "Which industry does cloudhms work in?",
        "Which field is cloudhms about?",
        "cloudhms's business domain?",
        "What's the cloudhms's Business or Domain?",
        "What's the cloudhms project 's Business or Domain?",
        "What's the cloudhms development project 's Business or Domain?",
        "What's this cloudhms's Business or Domain?",
        "What's this cloudhms project 's Business or Domain?",
        "What's this cloudhms development project 's Business or Domain?",
        "What is the cloudhms's Business or Domain?",
        "What is the cloudhms project 's Business or Domain?",
        "What is the cloudhms development project 's Business or Domain?",
        "What is this cloudhms's Business or Domain?",
        "What is this cloudhms project 's Business or Domain?",
        "What is this cloudhms development project 's Business or Domain?",
        "What's the cloudhms Business or Domain?",
        "What's the cloudhms project Business or Domain?",
        "What's the cloudhms development project Business or Domain?",
        "What is this cloudhms Business or Domain?",
        "What is this cloudhms project Business or Domain?",
        "What is this cloudhms development project Business or Domain?",
        "What is the Business or Domain of the cloudhms?",
        "What is the Business or Domain of the cloudhms project?",
        "What is the Business or Domain of the cloudhms development project?",
        "What is the Business or Domain of this cloudhms?",
        "What is the Business or Domain of this cloudhms project?",
        "What is the Business or Domain of this cloudhms development project?",
        "The Business or Domain of the cloudhms belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of the cloudhms project belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of the cloudhms development project belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of this cloudhms belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of this cloudhms project belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of this cloudhms development project belongs to the Hospitality area, doesn't it?",
        "The Business or Domain of the cloudhms belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of the cloudhms project belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of the cloudhms development project belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of this cloudhms belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of this cloudhms project belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of this cloudhms development project belongs to the Hospitality field, doesn't it?",
        "The Business or Domain of the cloudhms belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of the cloudhms project belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of the cloudhms development project belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of this cloudhms belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of this cloudhms project belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of this cloudhms development project belongs to the Hospitality industry, doesn't it?",
        "The Business or Domain of the cloudhms is in the Hospitality area, isn't it?",
        "The Business or Domain of the cloudhms project is in the Hospitality area, isn't it?",
        "The Business or Domain of the cloudhms development project is in the Hospitality area, isn't it?",
        "The Business or Domain of this cloudhms is in the Hospitality area, isn't it?",
        "The Business or Domain of this cloudhms project is in the Hospitality area, isn't it?",
        "The Business or Domain of this cloudhms development project is in the Hospitality area, isn't it?",
        "The Business or Domain of the cloudhms is in the Hospitality field, isn't it?",
        "The Business or Domain of the cloudhms project is in the Hospitality field, isn't it?",
        "The Business or Domain of the cloudhms development project is in the Hospitality field, isn't it?",
        "The Business or Domain of this cloudhms is in the Hospitality field, isn't it?",
        "The Business or Domain of this cloudhms project is in the Hospitality field, isn't it?",
        "The Business or Domain of this cloudhms development project is in the Hospitality field, isn't it?",
        "The Business or Domain of the cloudhms is in the Hospitality industry, isn't it?",
        "The Business or Domain of the cloudhms project is in the Hospitality industry, isn't it?",
        "The Business or Domain of the cloudhms development project is in the Hospitality industry, isn't it?",
        "The Business or Domain of this cloudhms is in the Hospitality industry, isn't it?",
        "The Business or Domain of this cloudhms project is in the Hospitality industry, isn't it?",
        "The Business or Domain of this cloudhms development project is in the Hospitality industry, isn't it?",
        "Is the Business or Domain of the cloudhms in the Hospitality area?",
        "Is the Business or Domain of the cloudhms project in the Hospitality area?",
        "Is the Business or Domain of the cloudhms development project in the Hospitality area?",
        "Is the Business or Domain of this cloudhms in the Hospitality area?",
        "Is the Business or Domain of this cloudhms project in the Hospitality area?",
        "Is the Business or Domain of this cloudhms development project in the Hospitality area?",
        "Is the Business or Domain of the cloudhms in the Hospitality field?",
        "Is the Business or Domain of the cloudhms project in the Hospitality field?",
        "Is the Business or Domain of the cloudhms development project in the Hospitality field?",
        "Is the Business or Domain of this cloudhms in the Hospitality field?",
        "Is the Business or Domain of this cloudhms project in the Hospitality field?",
        "Is the Business or Domain of this cloudhms development project in the Hospitality field?",
        "Is the Business or Domain of the cloudhms in the Hospitality industry?",
        "Is the Business or Domain of the cloudhms project in the Hospitality industry?",
        "Is the Business or Domain of the cloudhms development project in the Hospitality industry?",
        "Is the Business or Domain of this cloudhms in the Hospitality industry?",
        "Is the Business or Domain of this cloudhms project in the Hospitality industry?",
        "Is the Business or Domain of this cloudhms development project in the Hospitality industry?",
        "Does the Business or Domain of the cloudhms belong to the Hospitality area?",
        "Does the Business or Domain of the cloudhms project belong to the Hospitality area?",
        "Does the Business or Domain of the cloudhms development project belong to the Hospitality area?",
        "Does the Business or Domain of this cloudhms belong to the Hospitality?",
        "Does the Business or Domain of this cloudhms project belong to the Hospitality?",
        "Does the Business or Domain of this cloudhms development project belong to the Hospitality?",
        "Does the Business or Domain of the cloudhms belong to the Hospitality area?",
        "Does the Business or Domain of the cloudhms project belong to the Hospitality area?",
        "Does the Business or Domain of the cloudhms development project belong to the Hospitality area?",
        "Does the Business or Domain of this cloudhms belong to the Hospitality area?",
        "Does the Business or Domain of this cloudhms project belong to the Hospitality area?",
        "Does the Business or Domain of this cloudhms development project belong to the Hospitality area?",
        "Does the Business or Domain of the cloudhms belong to the Hospitality field?",
        "Does the Business or Domain of the cloudhms project belong to the Hospitality field?",
        "Does the Business or Domain of the cloudhms development project belong to the Hospitality field?",
        "Does the Business or Domain of this cloudhms belong to the Hospitality field?",
        "Does the Business or Domain of this cloudhms project belong to the Hospitality field?",
        "Does the Business or Domain of this cloudhms development project belong to the Hospitality field?"
      ],
      "responses": [
        "Yes, the Business or Domain of the cloudhms development project belong to Hospitality.",
        "Its domain is about Hospitality area.",
        "It provides Hospitality industry.",
        "The company is classified in the Hospitality industry?"
      ],
      "context_filter": "cloudhms"
    },
    {
      "tag": "cloudhms_start_date",
      "patterns": [
        "When was the contract between cloudhms and KMS signed?",
        "How long has cloudhms been our customer?",
        "What was the first date of cloudhms?",
        "Is the started date of the cloudhms in June 10, 2019?",
        "Was the cloudhms started in June 10, 2019?",
        "The cloudhms was started in June 10, 2019, wasn't it?",
        "In June 10, 2019, was the cloudhms started?",
        "Is the started date of the cloudhms project in June 10, 2019?",
        "Was the cloudhms project started in June 10, 2019?",
        "The cloudhms project was started in June 10, 2019, wasn't it?",
        "In June 10, 2019, was the cloudhms project started?",
        "Is the started date of the cloudhms development project in June 10, 2019?",
        "Was the cloudhms development project started in June 10, 2019?",
        "The cloudhms development project was started in June 10, 2019, wasn't it?",
        "In June 10, 2019, was the cloudhms development project started?",
        "when did the cloudhms start?",
        "when did the cloudhms begin?",
        "when did the cloudhms commence?",
        "when did the cloudhms initiate?",
        "when did the cloudhms project start?",
        "when did the cloudhms project begin?",
        "when did the cloudhms project commence?",
        "when did the cloudhms project initiate?",
        "when did the cloudhms development project start?",
        "when did the cloudhms development project begin?",
        "when did the cloudhms development project commence?",
        "when did the cloudhms development project initiate?",
        "when did this cloudhms start?",
        "when did this cloudhms begin?",
        "when did this cloudhms commence?",
        "when did this cloudhms initiate?",
        "when did this cloudhms project start?",
        "when did this cloudhms project begin?",
        "when did this cloudhms project commence?",
        "when did this cloudhms project initiate?",
        "when did this cloudhms development project start?",
        "when did this cloudhms development project begin?",
        "when did this cloudhms development project commence?",
        "when did this cloudhms development project initiate?",
        "what was the date the cloudhms started?",
        "what was the date the cloudhms begun?",
        "what was the date the cloudhms commenced?",
        "what was the date the cloudhms intiated?",
        "what was the date the cloudhms project started?",
        "what was the date the cloudhms project begun?",
        "what was the date the cloudhms project commenced?",
        "what was the date the cloudhms project intiated?",
        "what was the date the cloudhms development project started?",
        "what was the date the cloudhms development project begun?",
        "what was the date the cloudhms development project commenced?",
        "what was the date the cloudhms development project intiated?",
        "what was the date this cloudhms project started?",
        "what was the date this cloudhms project begun?",
        "what was the date this cloudhms project commenced?",
        "what was the date this cloudhms project intiated?",
        "what was the date this cloudhms development project started?",
        "what was the date this cloudhms development project begun?",
        "what was the date this cloudhms development project commenced?",
        "what was the date this cloudhms development project intiated?"
      ],
      "responses": [
        "Yes, The started date of cloudhms development project is June 10, 2019.",
        "It was on June 10, 2019.",
        "Since June 10, 2019"
      ],
      "context_filter": "cloudhms"
    },
    {
      "tag": "cloudhms_member",
      "patterns": [
        "Does cloudhms have many people work for it?",
        "Tell me the size of cloudhms team",
        "Are there 18+ (you know what I mean?) members in the cloudhms?",
        "Are there 18+ (you know what I mean?) members in the cloudhms project?",
        "Are there 18+ (you know what I mean?) members in the cloudhms development project?",
        "Are there 18+ (you know what I mean?) members in this cloudhms?",
        "Are there 18+ (you know what I mean?) members in this cloudhms project?",
        "Are there 18+ (you know what I mean?) members in this cloudhms development project?",
        "Are there 18+ (you know what I mean?) members in the cloudhms?",
        "Are there 18+ (you know what I mean?) members in the cloudhms project?",
        "Are there 18+ (you know what I mean?) members in the cloudhms development project?",
        "Are there 18+ (you know what I mean?) members in this cloudhms?",
        "Are there 18+ (you know what I mean?) members in this cloudhms project?",
        "Are there 18+ (you know what I mean?) members in this cloudhms development project?",
        "There are 18+ (you know what I mean?) members in the cloudhms, are not there?",
        "There are 18+ (you know what I mean?) members in the cloudhms project, are not there?",
        "There are 18+ (you know what I mean?) members in the cloudhms development project, are not there?",
        "There are 18+ (you know what I mean?) members in this cloudhms, are not there?",
        "There are 18+ (you know what I mean?) members in this cloudhms project, are not there?",
        "There are 18+ (you know what I mean?) members in this cloudhms development project, are not there?",
        "There are 18+ (you know what I mean?) members in the cloudhms, aren't there?",
        "There are 18+ (you know what I mean?) members in the cloudhms project, aren't there?",
        "There are 18+ (you know what I mean?) members in the cloudhms development project, aren't there?",
        "There are 18+ (you know what I mean?) members in this cloudhms, are not there?",
        "There are 18+ (you know what I mean?) members in this cloudhms project, are not there?",
        "There are 18+ (you know what I mean?) members in this cloudhms development project, are not there?",
        "How many people in the cloudhms?",
        "How many people in the cloudhms project?",
        "How many people in the cloudhms development project?",
        "How many people in this cloudhms?",
        "How many people in this cloudhms project?",
        "How many people in this cloudhms development project?",
        "How many members in the cloudhms?",
        "How many members in the cloudhms project?",
        "How many members in the cloudhms development project?",
        "How many members in this cloudhms?",
        "How many members in this cloudhms project?",
        "How many members in this cloudhms development project?",
        "How many persons in the cloudhms?",
        "How many persons in the cloudhms project?",
        "How many persons in the cloudhms development project?",
        "How many persons in this cloudhms?",
        "How many persons in this cloudhms project?",
        "How many persons in this cloudhms development project?",
        "How about team size of the cloudhms?",
        "How about team size of the cloudhms project?",
        "How about team size of the cloudhms development project?",
        "How about team size of this cloudhms?",
        "How about team size of this cloudhms project?",
        "How about team size of this cloudhms development project?",
        "How about team size in the cloudhms?",
        "How about team size in the cloudhms project?",
        "How about team size in the cloudhms development project?",
        "How about team size in this cloudhms?",
        "How about team size in this cloudhms project?",
        "How about team size in this cloudhms development project?",
        "How many people in the cloudhms?",
        "How many people in the cloudhms project?",
        "How many people in the cloudhms development project?",
        "How many people in this cloudhms?",
        "How many people in this cloudhms project?",
        "How many people in this cloudhms development project?",
        "How many members in the cloudhms?",
        "How many members in the cloudhms project?",
        "How many members in the cloudhms development project?",
        "How many members in this cloudhms?",
        "How many members in this cloudhms project?",
        "How many members in this cloudhms development project?",
        "How many persons in the cloudhms?",
        "How many persons in the cloudhms project?",
        "How many persons in the cloudhms development project?",
        "How many persons in this cloudhms?",
        "How many persons in this cloudhms project?",
        "How many persons in this cloudhms development project?",
        "How about team size of the cloudhms?",
        "How about team size of the cloudhms project?",
        "How about team size of the cloudhms development project?",
        "How about team size of this cloudhms?",
        "How about team size of this cloudhms project?",
        "How about team size of this cloudhms development project?",
        "How about team size in the cloudhms?",
        "How about team size in the cloudhms project?",
        "How about team size in the cloudhms development project?",
        "How about team size in this cloudhms?",
        "How about team size in this cloudhms project?",
        "How about team size in this cloudhms development project?"
      ],
      "responses": [
        "Yes, there are 18+ (you know what I mean?) members in the cloudhms development project.",
        "It is a group of 18+ (you know what I mean?) members",
        "The team size is 18+ (you know what I mean?).",
        "cloudhms is currently working well with 18+ (you know what I mean?)people"
      ],
      "context_filter": "cloudhms"
    },
    {
      "tag": "cloudhms_location",
      "patterns": [
        "How about the location of the cloudhms in TV office?",
        "How about the location of the cloudhms project  in TV office?",
        "How about the location of the cloudhms development project  in TV office?",
        "How about the location of this cloudhms in TV office?",
        "How about the location of this cloudhms project in TV office?",
        "How about the location of this cloudhms development project in TV office?",
        "What is the location of cloudhms?",
        "Where can I find cloudhms?",
        "How to meet cloudhms team?"
      ],
      "responses": [
        "You can find the cloudhms working space at 4th floor - TV office",
        "Do you intend to ask about the cloudhms's headquarters",
        "It's ETOWN Central, Floor 24th, 11 Doan Van Bo, District 4, HCMC. However, you can find the offshore team here in Ho Chi Minh City, at KMS TV Office - 4th floor.",
        "Go to 02 Tan Vien. Make sure you have an access badge, or you can get a visitor card at a Reception. Then go straight to an elevator. When you're inside it, press number 4."
      ],
      "context_filter": "cloudhms"
    },
    {
      "tag": "cloudhmsFavoriteActivities",
      "patterns": [
        "What do cloudhms team like to do?",
        "Which activities do cloudhms enjoy together?",
        "Favorite stuffs cloudhms do in free time?",
        "What do they do in their free time?",
        "Which fun fact do they do?",
        "What are favorite activities of the team?"
      ],
      "responses": [
        "Do you want to practice Vietnamese? Come join us! and Do you want to work onsite regularly? Come join us!"
      ],
      "context_filter": "cloudhms"
    }
  ]
}
